
Функция СписокПараметровСоединения() Экспорт 
	
	ММ = Новый Массив();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПП.Наименование КАК ИмяСервиса
		|ИЗ
		|	Справочник.scmВнешниеСервисы_ПараметрыСоединения КАК ПП";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ММ.Добавить(ВыборкаДетальныеЗаписи["ИмяСервиса"]);		
	КонецЦикла;
	
	Возврат ММ;
	
КонецФункции

Функция ПараметрыСоединения(ИмяСервиса) Экспорт 
	
	СС = Новый Структура("АдресРесурса, АдресРесурса, ХостСервера, ПортСервера, Пароль, ЗащищенноеСоединение");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПП.Наименование КАК ИмяСервиса,
		|	ПП.АдресРесурса КАК АдресРесурса,
		|	ПП.ХостСервера КАК ХостСервера,
		|	ПП.ПортСервера КАК ПортСервера,
		|	ПП.Пароль КАК Пароль,
		|	ПП.ЗащищенноеСоединение КАК ЗащищенноеСоединение
		|ИЗ
		|	Справочник.scmВнешниеСервисы_ПараметрыСоединения КАК ПП";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СС, ВыборкаДетальныеЗаписи); 		
	КонецЦикла;
	
	Возврат СС;
	
КонецФункции
