///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции работы с пользователями.

// Только для внутреннего использования.
Функция АвторизованныйПользователь() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Если Не ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
	//	ТекстОшибки = ТекстСообщенияТекущийПользовательНедоступенВСеансеБезРазделителей();
	//	ВызватьИсключение ТекстОшибки;
	//КонецЕсли;
	
	Возврат (ПараметрыСеанса.ТекущийПользователь);
	//Возврат ?(ЗначениеЗаполнено(ПараметрыСеанса.ТекущийПользователь),
	//          ПараметрыСеанса.ТекущийПользователь,
	//          ПараметрыСеанса.ТекущийВнешнийПользователь);
	
КонецФункции

#КонецОбласти
