#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"
	|ВЫБРАТЬ
	|	ВнешниеИнформационныеБазы.Ссылка = ЗНАЧЕНИЕ(Справочник.ВнешниеИнформационныеБазы.ТекущаяИБ) КАК Выбран,
	|	ВнешниеИнформационныеБазы.Ссылка = ЗНАЧЕНИЕ(Справочник.ВнешниеИнформационныеБазы.ТекущаяИБ) КАК ТекущаяИБ,
	|	ВнешниеИнформационныеБазы.Ссылка КАК ВнешняяИБ,
	|	ВнешниеИнформационныеБазы.ТипБД КАК ТипБД,
	|	ВнешниеИнформационныеБазы.ПутьКWebСервису КАК ПутьКWebСервису,
	|	ВнешниеИнформационныеБазыНТ_Организации.Организация КАК Организация
	|ИЗ
	|	Справочник.ВнешниеИнформационныеБазы КАК ВнешниеИнформационныеБазы
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВнешниеИнформационныеБазы.НТ_Организации КАК ВнешниеИнформационныеБазыНТ_Организации
	|		ПО ВнешниеИнформационныеБазыНТ_Организации.Ссылка = ВнешниеИнформационныеБазы.Ссылка
	|ГДЕ
	|	ВнешниеИнформационныеБазы.Ссылка.ИспользоватьWS = ИСТИНА
	|	И ВнешниеИнформационныеБазы.Ссылка.ПометкаУдаления = ЛОЖЬ 
	|УПОРЯДОЧИТЬ ПО Выбран Убыв, Организация Убыв";
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	
	СписокВнешнихИнформационныхБаз.Загрузить(ПакетЗапросов[0].Выгрузить());
	УстановитьУсловноеОформление();	
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВнешниеБД_СнятьОтметить(Команда)
	ВнешниеБД_СнятьОтметитьВсе(Команда.Имя);
КонецПроцедуры

Процедура ВнешниеБД_СнятьОтметитьВсе(КомандаИмя, ОтмечатьТекущаяИБ = Истина, ВнешняяИБ = Неопределено) 
	Выбран = ?(СтрЧислоВхождений(КомандаИмя, "ВыбратьВсе") = 1, Истина, Ложь);
	ВыбратьЕстьСсылка = ?(СтрЧислоВхождений(КомандаИмя, "ВыбратьЕстьСсылка") = 1, Истина, Ложь);
	Для Каждого ЭлеменСписка Из СписокВнешнихИнформационныхБаз Цикл
		ЭлеменСписка.Выбран = Выбран;
		ЭлеменСписка.Выбран = ?(ВыбратьЕстьСсылка, ЭлеменСписка.ЕстьСсылка, ЭлеменСписка.Выбран);
		ЭлеменСписка.Выбран = ?(ЭлеменСписка.ТекущаяИБ И ОтмечатьТекущаяИБ, Истина, ЭлеменСписка.Выбран); 
		Если ВнешняяИБ <> Неопределено И ЭлеменСписка.ВнешняяИБ = ВнешняяИБ Тогда 
			ЭлеменСписка.Выбран = Истина;
		КонецЕсли;	
		Если ЭлеменСписка.Выбран Тогда 
			Элементы.СписокВнешнихИнформационныхБаз.ТекущаяСтрока = ЭлеменСписка.ПолучитьИдентификатор();
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет()
	СформироватьОтчетНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетНаСервере()
		
	ТаблицаРезультат_0 = Неопределено; 
	СтруктураПараметровЗапроса = Неопределено;
	ТаблицаАналитикиВИБ = "";
	
	Для Каждого ЭлеменСписка Из СписокВнешнихИнформационныхБаз Цикл 
		Если ЭлеменСписка.Выбран Тогда
						
			Если ЭлеменСписка.ТекущаяИБ Тогда 
				Запрос = Новый Запрос;
				Запрос.Текст = ТекстЗапроса;
				//Для Каждого Элемент Из СтруктураПараметровЗапроса Цикл
				//	Запрос.УстановитьПараметр(Элемент.Ключ, Элемент.Значение);
				//КонецЦикла;	
				РезультатЗапроса = Запрос.Выполнить().Выгрузить();
				
			Иначе 	
				ТекСоединениеВИБ = УправлениеСоединениямиВИБУХ.ПолучитьСоединение(ЭлеменСписка.ВнешняяИБ, 1);		
				Если ТекСоединениеВИБ = Неопределено Тогда
					Сообщить("Ошибка соединения с базой " + ЭлеменСписка.ВнешняяИБ);
					ЭлеменСписка.ФлагОшибкаСоединения = Истина;
					ЭлеменСписка.Выбран = Ложь;
				Иначе 	
					ДанныеЗапроса = ПодготовитьДанныеЗапроса(ТекстЗапроса, ТаблицаАналитикиВИБ,, СтруктураПараметровЗапроса);				
					ТаблицаДанных = ТекСоединениеВИБ.GetWorkingDataTable(Новый ХранилищеЗначения(ДанныеЗапроса, Новый СжатиеДанных(9))).Получить(); 
					ЭлеменСписка.ФлагОшибкаСоединения = Ложь;
					Если ТипЗнч(ТаблицаДанных) = Тип("Структура") Тогда 
						РезультатЗапроса = ТаблицаДанных.ТаблицаПереноса.Скопировать();
					Иначе 	
						РезультатЗапроса = Новый ТаблицаЗначений();
					КонецЕсли;

				КонецЕсли;
			КонецЕсли;
			
			Если ЭлеменСписка.ФлагОшибкаСоединения Тогда 
				Продолжить;
			КонецЕсли;
			РезультатЗапроса.Колонки.Добавить("ВнешняяИБ", ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСсылка("СправочникСсылка.ВнешниеИнформационныеБазы"));
			РезультатЗапроса.Колонки.Добавить("ПустойРезультат", ОбщегоНазначенияУХ.ПолучитьОписаниеТиповБулево());   
			Если РезультатЗапроса.Количество() = 0 Тогда
				н = РезультатЗапроса.Добавить(); 
				н.ПустойРезультат = Истина;
			//	н.АВТОНОМЕРЗАПИСИ = 0;				
			КонецЕсли;	
			РезультатЗапроса.ЗаполнитьЗначения(ЭлеменСписка.ВнешняяИБ, "ВнешняяИБ");
			Если ТаблицаРезультат_0 = Неопределено Тогда 				
				ТаблицаРезультат_0 = РезультатЗапроса.Скопировать(); 	
			Иначе 	                        
				ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(РезультатЗапроса, ТаблицаРезультат_0);
			КонецЕсли;
			
		КонецЕсли;	
	КонецЦикла;		
	
	ВывестиТабличныйДокумент(ТаблицаПравилИспользованияПолей, ТаблицаРезультат_0);

КонецПроцедуры 

Процедура ВывестиТабличныйДокумент(ТаблицаПравилИспользованияПолей, ТаблицаРезультат_0)
	
	ТекущаяИБ = Справочники.ВнешниеИнформационныеБазы.ТекущаяИБ;
	
	Макет = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("Макет");
	ОбластьДетали = Макет.ПолучитьОбласть("Детали|Колонка");
	ОбластьШапка = Макет.ПолучитьОбласть("ДеталиШапка|Колонка");
	ШрифтОбычный = ОбластьДетали.ТекущаяОбласть.Шрифт;
	ШрифтЖирный = Новый Шрифт(ШрифтОбычный,,,истина);
	
	ТабличныйДокумент.Очистить();
	ОбластьШапка.Параметры.Текст = "Имя БД";
	ТабличныйДокумент.Вывести(ОбластьШапка); 
	мВнешняяИБ = ТаблицаРезультат_0.Скопировать(, "ВнешняяИБ");
    мВнешняяИБ.Свернуть("ВнешняяИБ");
	
	Для Каждого Правило Из ТаблицаПравилИспользованияПолей Цикл 
		ОбластьШапка.Параметры.Текст = Правило.Поле;
		ТабличныйДокумент.Присоединить(ОбластьШапка);
	КонецЦикла;
	
	Для Каждого м Из мВнешняяИБ Цикл 
		
		текЗначение = Неопределено;
        РезультатЗапроса = ТаблицаРезультат_0.Скопировать(Новый Структура("ВнешняяИБ", м.ВнешняяИБ));
		Для Каждого тЗначениеВыборки Из РезультатЗапроса Цикл 
			ОбластьДетали.Параметры.Текст = м.ВнешняяИБ;	
			тОбласть = ТабличныйДокумент.Вывести(ОбластьДетали);
			Для Каждого Правило Из ТаблицаПравилИспользованияПолей Цикл 
	            Попытка
					текЗначение = тЗначениеВыборки[СтрЗаменить(Правило.Поле, ".", "_")];
				Исключение
					текЗначение = "<>";
				КонецПопытки;
				ОбластьДетали.Параметры.Текст = текЗначение;
				тОбласть = ТабличныйДокумент.Присоединить(ОбластьДетали);
			КонецЦикла;
	
		КонецЦикла;
	КонецЦикла;  

КонецПроцедуры

Функция ПодготовитьДанныеЗапроса(ТекстЗапроса, ТаблицаАналитикиВИБ, GUIDвнешнейСсылки = "", СтруктураПараметров = Неопределено)
	
	ИспользуемыеПараметры = Новый ТаблицаЗначений;
	ИспользуемыеПараметры.Колонки.Добавить("ИмяПараметра");
	ИспользуемыеПараметры.Колонки.Добавить("ПолеБД");
	ИспользуемыеПараметры.Колонки.Добавить("ЗначениеПараметра");
	ИспользуемыеПараметры.Колонки.Добавить("ВидСравнения");
	ИспользуемыеПараметры.Колонки.Добавить("Вычислять", ОбщегоНазначенияУХ.ПолучитьОписаниеТиповБулево());

	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("ТекстЗапроса", ТекстЗапроса);
	СтруктураЗапроса.Вставить("ПроизвольныйЗапрос", Истина);
	СтруктураЗапроса.Вставить("ТаблицаАналитикиВИБ", ТаблицаАналитикиВИБ);

	Если GUIDвнешнейСсылки <> "" Тогда 
		
		МассивGUID = Новый Массив();
		МассивGUID.Добавить(GUIDвнешнейСсылки);
		СтруктураЗапроса.Вставить("МассивGUID", МассивGUID);

		НоваяСтрока = ИспользуемыеПараметры.Добавить();
		НоваяСтрока.ИмяПараметра		= "МассивGUID";
		НоваяСтрока.ПолеБД				= "Ссылка";
		НоваяСтрока.ЗначениеПараметра	= СтруктураЗапроса.МассивGUID;
		НоваяСтрока.ВидСравнения		= "InList";
		
	Иначе		
		Если Не СтруктураПараметров = Неопределено Тогда 
			Для Каждого Элемент Из СтруктураПараметров Цикл
				НоваяСтрока = ИспользуемыеПараметры.Добавить();
				НоваяСтрока.ИмяПараметра		= Элемент.Ключ;
				НоваяСтрока.ПолеБД				= Элемент.Ключ;
				НоваяСтрока.ЗначениеПараметра	= Элемент.Значение;
				НоваяСтрока.ВидСравнения		= "Equal";
			КонецЦикла;	
		КонецЕсли;

	КонецЕсли;

	ИспользуемыеПоля = Новый ТаблицаЗначений;
	ИспользуемыеПоля.Колонки.Добавить("ИмяПоля");
	ИспользуемыеПоля.Колонки.Добавить("ПутьКДанным");
	
	Для Каждого Правило Из ТаблицаПравилИспользованияПолей Цикл 
		ДобавитьПолеВТаблицуПолей(ИспользуемыеПоля, Правило.РеквизитАналитики, Правило.Поле);
	КонецЦикла;
	
	ДанныеЗапроса = Новый Структура;
	ДанныеЗапроса.Вставить("ТекстЗапроса",			СтруктураЗапроса.ТекстЗапроса);
	ДанныеЗапроса.Вставить("ИспользуемыеПараметры",	ИспользуемыеПараметры);
	ДанныеЗапроса.Вставить("ИспользуемыеПоля",		ИспользуемыеПоля);
	ДанныеЗапроса.Вставить("ПроизвольныйЗапрос",	СтруктураЗапроса.ПроизвольныйЗапрос);
	ДанныеЗапроса.Вставить("ТаблицаАналитикиВИБ",	СтруктураЗапроса.ТаблицаАналитикиВИБ);
	
	Возврат ДанныеЗапроса;
	
КонецФункции

Процедура ДобавитьПолеВТаблицуПолей(ТаблицаПолей, ПутьКДанным, ИмяПоля)
	
	НоваяСтрока             = ТаблицаПолей.Добавить();
	НоваяСтрока.ИмяПоля     = ИмяПоля;
	НоваяСтрока.ПутьКДанным = ПутьКДанным;
	
КонецПроцедуры

&НаСервере
Процедура ТекстЗапросаПриИзмененииНаСервере()  
	
	ТаблицаПравилИспользованияПолей.Очистить();
	СхемаЗапроса = Новый СхемаЗапроса;              
	Попытка
		СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
		Для Каждого Пакет Из СхемаЗапроса.ПакетЗапросов Цикл 
			Для Каждого Колонка Из Пакет.Колонки Цикл 			
				НН = ТаблицаПравилИспользованияПолей.Добавить();		
				НН.РеквизитАналитики = Колонка.Псевдоним;
				НН.Поле = Колонка.Псевдоним;
				НН.ТаблицаАналитики = "";
				НН.ТаблицаАналитикиВИБ = "";
				НН.НастройкаСоответствияРеквизит = Неопределено;
				НН.УровеньВложенности = 1;	
				НН.НеИспользоватьДляСинхронизации = Истина;
			КонецЦикла;	
		КонецЦикла;	
	Исключение
		ТекстОшибкиЗапроса = ОписаниеОшибки();
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ТекстЗапросаПриИзменении(Элемент)
	ТекстЗапросаПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокВнешнихИнформационныхБаз.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СписокВнешнихИнформационныхБаз.ФлагОшибкаСоединения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоРозовый);
 
КонецПроцедуры

#КонецОбласти

