#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

Процедура ЗарегистрироватьВУзлеОбмена(мНаборЗаписей = Неопределено) Экспорт 
	
	Если мНаборЗаписей = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
	МассивУзловДляРегистрации = ПланыОбмена.scmОбменСМобильнымПриложением.ПолучитьЗапросомМассивУзловПоОграничениям(мНаборЗаписей, Новый Структура);
	Для Каждого Элемент Из МассивУзловДляРегистрации Цикл
		ПланыОбмена.ЗарегистрироватьИзменения(Элемент, мНаборЗаписей);
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#Область Интерфейс

Функция ВернутьТекущееСостояние(Период, Накладная) Экспорт 
	
	ТекущееСостояние = Перечисления.СостояниеНакладной.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостоянияНакладныхСрезПоследних.Состояние КАК Состояние
		|ИЗ
		|	РегистрСведений.scmСостоянияНакладных.СрезПоследних(&Период, Накладная = &Накладная) КАК СостоянияНакладныхСрезПоследних";
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Накладная", Накладная);
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекущееСостояние =  ВыборкаДетальныеЗаписи.Состояние;
	КонецЦикла;
	
	Возврат ТекущееСостояние;
	
КонецФункции

Процедура УстановитьНовоеСостояние(Накладная, СледующееСостояние, Сотрудник = Неопределено, Источник = "") Экспорт 
	
	НаборЗаписей = РегистрыСведений.scmСостоянияНакладных.СоздатьНаборЗаписей();
    НаборЗаписей.Отбор.Накладная.Установить(Накладная);    
 
    Запись = НаборЗаписей.Добавить();
    Запись.Период = ТекущаяДата();
    Запись.Накладная = Накладная;
	//Запись.Сотрудник = Сотрудник;
    Запись.Состояние = СледующееСостояние;
    Запись.Источник = Источник;
    НаборЗаписей.Записать(Истина);	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли