#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПараметрыОбменаНСИ.Ссылка КАК Ссылка,
	|	Представление(ПараметрыОбменаНСИ.Ссылка) КАК Представление,
	|	ВЫБОР КОГДА ПараметрыОбменаНСИ.Отключен ТОГДА ""(отключен)"" ИНАЧЕ """" КОНЕЦ КАК Дополнение,
	|	ПараметрыОбменаНСИ.Отключен КАК Отключен
	|ИЗ
	|	Справочник.ПараметрыОбменаНСИ КАК ПараметрыОбменаНСИ
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	""ДоговорыКонтрагентов"" КАК Ссылка,
	|	""Договоры"" КАК Представление,
	|	"""" КАК Дополнение,
	|	ИСТИНА КАК Отключен
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	""Пользователи"" КАК Ссылка,
	|	""Пользователи"" КАК Представление,
	|	"""" КАК Дополнение,
	|	ИСТИНА КАК Отключен
	|УПОРЯДОЧИТЬ ПО Отключен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВнешниеИнформационныеБазы.Ссылка = ЗНАЧЕНИЕ(Справочник.ВнешниеИнформационныеБазы.ТекущаяИБ) КАК Выбран,
	|	ВнешниеИнформационныеБазы.Ссылка = ЗНАЧЕНИЕ(Справочник.ВнешниеИнформационныеБазы.ТекущаяИБ) КАК ТекущаяИБ,
	|	ВнешниеИнформационныеБазы.Ссылка КАК ВнешняяИБ,
	|	ВнешниеИнформационныеБазы.ТипБД КАК ТипБД,
	|	ВнешниеИнформационныеБазы.ПутьКWebСервису КАК ПутьКWebСервису,
	|	ВнешниеИнформационныеБазыНТ_Организации.Организация КАК Организация
	|ИЗ
	|	Справочник.ВнешниеИнформационныеБазы КАК ВнешниеИнформационныеБазы
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВнешниеИнформационныеБазы.НТ_Организации КАК ВнешниеИнформационныеБазыНТ_Организации
	|		ПО ВнешниеИнформационныеБазыНТ_Организации.Ссылка = ВнешниеИнформационныеБазы.Ссылка
	|ГДЕ
	|	ВнешниеИнформационныеБазы.Ссылка.ИспользоватьWS = ИСТИНА
	|	И ВнешниеИнформационныеБазы.Ссылка.ПометкаУдаления = ЛОЖЬ 
	|УПОРЯДОЧИТЬ ПО Выбран Убыв, Организация Убыв";
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	ЗначенияНаправлениеОбмена = ПакетЗапросов[0].Выбрать();
	Пока ЗначенияНаправлениеОбмена.Следующий() Цикл 
		Элементы.ИмяСправочника.СписокВыбора.Добавить(ЗначенияНаправлениеОбмена.Ссылка, ЗначенияНаправлениеОбмена.Представление + " " + ЗначенияНаправлениеОбмена.Дополнение);
	КонецЦикла;	
	
	СписокВнешнихИнформационныхБаз.Загрузить(ПакетЗапросов[1].Выгрузить());
	УстановитьУсловноеОформление();	
	НастройкаВыводитьТабличныеЧасти = Истина;
	
КонецПроцедуры 

&НаКлиенте
Процедура СписокВнешнихИнформационныхБазВыбранПриИзменении1(Элемент)
	ОбновитьТаблицаПравилИспользованияПолей();
	ОбновитьКлючевыеПолеПоиска();
КонецПроцедуры

&НаКлиенте
Процедура РезультатГлавноеОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	СтандартнаяОбработка = Ложь;
	Действия_ = Новый СписокЗначений;
	Если Лев(Расшифровка, 10) = "e1cib/data" Тогда 
		Действия_.Добавить("ПоказатьСсылку", "Показать ссылку", , БиблиотекаКартинок.СкопироватьОбъект); 
	ИначеЕсли Лев(Расшифровка, 1) = "#" Тогда 
		мРасшифровка = СтрРазделить(Сред(Расшифровка, 2), ";");
	//	Расшифровка = мРасшифровка[0];
		Если Не мРасшифровка[0] = "Текущая информационная база" Тогда 
			Действия_.Добавить("СоздатьОбъектВЭтойБД", "Создать объект из этой БД", , БиблиотекаКартинок.СкопироватьОбъект); 
			Если мРасшифровка[1] = "Нет" Тогда 
				Действия_.Добавить("СвязатьЭлементСЭтойБД", "Связать элемент с этой БД", , БиблиотекаКартинок.ПолучитьНавигационнуюСсылку);			
			КонецЕсли;                                                
		КонецЕсли;
	КонецЕсли;	
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ОписаниеОповещенияОЗакрытии", ЭтотОбъект, Расшифровка);		
	ПоказатьВыборИзМеню(ОписаниеОповещенияОЗакрытии, Действия_, Элемент);
	//7702232171
	//770201001
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеОповещенияОЗакрытии(ВыбранныйЭлемент, Расшифровка) Экспорт

	мРасшифровка = СтрРазделить(Сред(Расшифровка, 2), ";");
	ВнешняяИБ = ПолучитьВнешняяИБПоИмени(мРасшифровка[0]);
	Если ВыбранныйЭлемент = Неопределено Тогда
    ИначеЕсли ВыбранныйЭлемент.Значение = "ПоказатьСсылку" Тогда
       Сообщить(Расшифровка);
   	ИначеЕсли ВыбранныйЭлемент.Значение = "СоздатьОбъектВЭтойБД" Тогда
		НайденОбъектВнешнейБДПоСсылке = Ложь;
//		ВнешниеБД_СнятьОтметитьВсе(Команды.ВнешниеБД_ОтменитьВсе, Ложь, ВнешняяИБ);
		ВнешниеБД_СнятьОтметитьВсе("ВнешниеБД_ОтменитьВсе", Ложь, ВнешняяИБ);
	//	СформироватьОтчет_ПоРеквизитам(Истина); 
		СформироватьОтчет_ПоGUID(ВнешняяИБ, мРасшифровка[2], НайденОбъектВнешнейБДПоСсылке, Истина); 
		СоздатьОбъектВЭтойБД(ВнешняяИБ);
   	ИначеЕсли ВыбранныйЭлемент.Значение = "СвязатьЭлементСЭтойБД" Тогда
		СвязатьЭлементСЭтойБДНаСервере(ВнешняяИБ);
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВнешняяИБПоИмени(ДополнительныеПараметры)
	Возврат Справочники.ВнешниеИнформационныеБазы.НайтиПоНаименованию(ДополнительныеПараметры);
КонецФункции	

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	ТекущиеДанные = Элементы.СписокВнешнихИнформационныхБаз.ТекущиеДанные;

	Если Не ЗначениеЗаполнено(ТекущийПараметрОбменаНСИ) Тогда 
		ПоказатьПредупреждение(, "Не выбран ""Тип объекта""");
		Возврат;
	КонецЕсли;	
	мВыбран = СписокВнешнихИнформационныхБаз.НайтиСтроки(Новый Структура("Выбран", Истина));
	Если мВыбран.Количество() = 0 Тогда 
		Сообщить("Не выбрана внешняя ИБ для получения данных по внешней ссылке");
		Возврат;
	ИначеЕсли ЭтоВнешняяСсылка И мВыбран.Количество() > 1 Тогда //Не НастройкаРежимПоискаПоРевизитам И 
		Сообщить("Должна быть выбрана только одна ИБ, для получения данных по внешней ссылке");
		Возврат;
	КонецЕсли;	
	
	Если НастройкаРежимПоискаПоРевизитам Тогда
		КоличествоЗаполненных = 0;
		Для Каждого Элемент Из СписокКлючевыхРеквизитов Цикл 
			Если Не ПустаяСтрока(ЭтотОбъект[Элемент.Значение]) Тогда
				КоличествоЗаполненных = КоличествоЗаполненных + 1;
			КонецЕсли;
		КонецЦикла; 
		Если КоличествоЗаполненных = 0 Тогда 
			Сообщить("Не заполнены ключевые поля поиска");
			Возврат;
		КонецЕсли;	
	КонецЕсли;

	НайденОбъектВнешнейБДПоСсылке = Ложь;
	
	Если ЗначениеЗаполнено(ОбъектТекущейИБ) ИЛИ НастройкаРежимПоискаПоРевизитам Тогда 
		СформироватьОтчет_ПоРеквизитам(); 
	ИначеЕсли ЭтоВнешняяСсылка И Не ТекущиеДанные = Неопределено Тогда 	
		СформироватьОтчет_ПоGUID(ТекущиеДанные.ВнешняяИБ, ,НайденОбъектВнешнейБДПоСсылке); 
	ИначеЕсли Не ЭтоВнешняяСсылка Тогда 
		Сообщить("Не выбран Объект текущей ИБ");
	КонецЕсли;	
	
	Если ЭтоВнешняяСсылка И НайденОбъектВнешнейБДПоСсылке Тогда 
		НастройкаРежимПоискаПоРевизитам = Истина;
		НастройкаРежимПоискаПоРевизитамПриИзменении(Элементы._URL); 
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьСценарийПоискаИсточникаСозданияКонтрагента", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Выполнить поиск объекта во всех базах по ключемым реквизитам?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;	


КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСценарийПоискаИсточникаСозданияКонтрагента(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ВнешниеБД_СнятьОтметитьВсе("ВнешниеБД_ВыбратьВсе"); 
		// для тестовой БД
		//Для Каждого ЭлеменСписка Из СписокВнешнихИнформационныхБаз Цикл
		//	ЭлеменСписка.Выбран = Ложь;
		//	Если Строка(ЭлеменСписка.ВнешняяИБ) = "ЕРП Актив" ИЛИ Строка(ЭлеменСписка.ВнешняяИБ) = "Документооборот"
		//		ИЛИ Строка(ЭлеменСписка.ВнешняяИБ) = "ХК" ИЛИ Строка(ЭлеменСписка.ВнешняяИБ) = "Текущая информационная база" Тогда 
		//		ЭлеменСписка.Выбран = Истина;
		//	КонецЕсли;
		//КонецЦикла;
		// для тестовой БД
		ОбновитьТаблицаПравилИспользованияПолей();

		СформироватьОтчет_ПоРеквизитам(); 
	//	ВнешниеБД_СнятьОтметитьВсе("ВнешниеБД_ОтменитьВсе", Ложь);
	//	Элементы.ГруппаСоздатьОбъект.Видимость = Истина;
	Иначе 
		ЭтоВнешняяСсылка = Ложь; // для возможности ручного выбора баз для проверки 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИмяСправочникаПриИзмененииНаСервере()
	
	СписокТипов = Новый Массив;
	Если ТипЗнч(ТекущийПараметрОбменаНСИ) = Тип("Строка") Тогда 
		СписокТипов.Добавить(Тип("СправочникСсылка." + ТекущийПараметрОбменаНСИ));
	Иначе 	
		СписокТипов.Добавить(Тип("СправочникСсылка." + ТекущийПараметрОбменаНСИ.ОписаниеОбъектаМетаданных.ИмяОбъектаМетаданных));
	КонецЕсли;	
	ОписаниеТипа = Новый ОписаниеТипов(СписокТипов); 
	Элементы.ОбъектТекущейИБ.ОграничениеТипа = ОписаниеТипа; 
//	Элементы.ГруппаСоздатьОбъект.Видимость = Ложь;
	кешИмяОбъектаМетаданных = ТекущийПараметрОбменаНСИ.ОписаниеОбъектаМетаданных.ИмяОбъектаМетаданных;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяСправочникаПриИзменении(Элемент)
	ИмяСправочникаПриИзмененииНаСервере();
	СписокВнешнихИнформационныхБазВыбранПриИзменении();
	ОбновитьТаблицаПравилИспользованияПолей();
	НастройкаРежимПоискаПоРевизитамПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура СписокВнешнихИнформационныхБазПриАктивизацииСтроки(Элемент)
	СписокВнешнихИнформационныхБазВыбранПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура СписокВнешнихИнформационныхБазВыбранПриИзменении()
	ТекущиеДанные = Элементы.СписокВнешнихИнформационныхБаз.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда 
	//	Если кэшТипБД <> ТекущиеДанные.ТипБД Тогда 
			СоответствиеВнешнимИБ = ПолучитьЗначениеСоответствиеВнешнимИБ(ТекущийПараметрОбменаНСИ, ТекущиеДанные.ТипБД);
	//	КонецЕсли;
	//	кэшТипБД = ТекущиеДанные.ТипБД;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ОбъектТекущейИБПриИзмененииНаСервере()
	
	// Обновление ЕстьСсылка в списке внешних ИБ для выбранного объекта	
	мСписокВнешнихИнформационныхБаз = СписокВнешнихИнформационныхБаз.Выгрузить();
	мСписокВнешнихИнформационныхБаз.ЗаполнитьЗначения(Ложь, "ЕстьСсылка");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СоответствиеОбъектовТекущейИВнешнихИБ.ОбъектТекущейИБ КАК ОбъектТекущейИБ,
		|	СоответствиеОбъектовТекущейИВнешнихИБ.ОбъектВнешнейИБ КАК ОбъектВнешнейИБ,
		|	СоответствиеОбъектовТекущейИВнешнихИБ.ИспользуемаяИБ КАК ИспользуемаяИБ,
		|	0 КАК ДопПоля
		|ИЗ
		|	РегистрСведений.СоответствиеОбъектовТекущейИВнешнихИБ КАК СоответствиеОбъектовТекущейИВнешнихИБ
		| ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты По Контрагенты.Ссылка = &ОбъектТекущейИБ
		|ГДЕ
		|	СоответствиеОбъектовТекущейИВнешнихИБ.ОбъектТекущейИБ = &ОбъектТекущейИБ";
	
	Запрос.УстановитьПараметр("ОбъектТекущейИБ", ОбъектТекущейИБ);
		
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		мВнешняяИБ = мСписокВнешнихИнформационныхБаз.НайтиСтроки(Новый Структура("ВнешняяИБ", ВыборкаДетальныеЗаписи.ИспользуемаяИБ));
		мВнешняяИБ[0].ЕстьСсылка = Истина;
	КонецЦикла; 
	мВнешняяИБ = мСписокВнешнихИнформационныхБаз.НайтиСтроки(Новый Структура("ТекущаяИБ", Истина));
	мВнешняяИБ[0].Выбран = Истина;
	
	СписокВнешнихИнформационныхБаз.Загрузить(мСписокВнешнихИнформационныхБаз);

	//Обновление ИменаКлючевыхРеквизитов для выбранного объекта
	МассивКлючевыхПолей = Новый Массив();
	Для Каждого Элемент Из СписокКлючевыхРеквизитов Цикл
		Если Элемент.Представление = кешИмяОбъектаМетаданных Тогда 
			ЭтотОбъект[Элемент.Значение] = "";
			мКлючевойРеквизит = СтрРазделить(Элемент.Значение, "spr");
			Реквизит = "";
			Для м = 1 По мКлючевойРеквизит.Количество()-1 Цикл 
				Реквизит = Реквизит + СтрЗаменить(мКлючевойРеквизит[м], "dot", ".");
			КонецЦикла;	
			МассивКлючевыхПолей.Добавить(Символы.Таб + кешИмяОбъектаМетаданных + "." + Реквизит + " КАК " + Элемент.Значение);
		КонецЕсли;
	КонецЦикла;	
	ДопПоля = СтрСоединить(МассивКлючевыхПолей, "," + Символы.ПС);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	0 КАК ДопПоля
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты ГДЕ Контрагенты.Ссылка = &ОбъектТекущейИБ";
	
	Запрос.УстановитьПараметр("ОбъектТекущейИБ", ОбъектТекущейИБ);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Справочник.Контрагенты КАК Контрагенты ГДЕ Контрагенты.Ссылка = &ОбъектТекущейИБ", 
	"Справочник." + кешИмяОбъектаМетаданных + " КАК " + кешИмяОбъектаМетаданных + " ГДЕ " + кешИмяОбъектаМетаданных + ".Ссылка = &ОбъектТекущейИБ");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "0 КАК ДопПоля", ДопПоля); 
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Для Каждого Элемент Из СписокКлючевыхРеквизитов Цикл 
			Если Элемент.Представление = кешИмяОбъектаМетаданных Тогда 
				ЭтотОбъект[Элемент.Значение] = ВыборкаДетальныеЗаписи[Элемент.Значение];
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла; 
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбъектТекущейИБПриИзменении(Элемент)
	
	ЭтоВнешняяСсылка = Ложь;
	ОбновитьИмяСправочникаПоВыбранномуОбъектТекущейИБ();
	ОбъектТекущейИБПриИзмененииНаСервере();
	ОбновитьЗаголовокКнопкиСформироватьОтчет();
	Элементы.НайтиОбъектПоURL.Заголовок = "Найти объект по URL";
	Элементы.НайтиОбъектПоURL.ЦветФона = WebЦвета.Белый;
	
КонецПроцедуры

Процедура ОбновитьЗаголовокКнопкиСформироватьОтчет()
	Если НастройкаРежимПоискаПоРевизитам Тогда 	
		Элементы.СформироватьОтчет.Заголовок = "Сформировать отчет (по ключевым полям)";
	ИначеЕсли ЭтоВнешняяСсылка Тогда 
		Элементы.СформироватьОтчет.Заголовок = "Сформировать отчет (внешняя ссылка)";
	ИначеЕсли ОбъектТекущейИБ <> Неопределено Тогда 
		Элементы.СформироватьОтчет.Заголовок = "Сформировать отчет (по ссылке)";
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВнешниеБД_СнятьОтметить(Команда)
	ВнешниеБД_СнятьОтметитьВсе(Команда.Имя);
КонецПроцедуры

Процедура ВнешниеБД_СнятьОтметитьВсе(КомандаИмя, ОтмечатьТекущаяИБ = Истина, ВнешняяИБ = Неопределено) 
	Выбран = ?(СтрЧислоВхождений(КомандаИмя, "ВыбратьВсе") = 1, Истина, Ложь);
	ВыбратьЕстьСсылка = ?(СтрЧислоВхождений(КомандаИмя, "ВыбратьЕстьСсылка") = 1, Истина, Ложь);
	Для Каждого ЭлеменСписка Из СписокВнешнихИнформационныхБаз Цикл
		ЭлеменСписка.Выбран = Выбран;
		ЭлеменСписка.Выбран = ?(ВыбратьЕстьСсылка, ЭлеменСписка.ЕстьСсылка, ЭлеменСписка.Выбран);
		ЭлеменСписка.Выбран = ?(ЭлеменСписка.ТекущаяИБ И ОтмечатьТекущаяИБ, Истина, ЭлеменСписка.Выбран); 
		Если ВнешняяИБ <> Неопределено И ЭлеменСписка.ВнешняяИБ = ВнешняяИБ Тогда 
			ЭлеменСписка.Выбран = Истина;
		КонецЕсли;	
		Если ЭлеменСписка.Выбран Тогда 
			Элементы.СписокВнешнихИнформационныхБаз.ТекущаяСтрока = ЭлеменСписка.ПолучитьИдентификатор();
		КонецЕсли;	
	КонецЦикла;
	ОбновитьТаблицаПравилИспользованияПолей();
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеТаблицыПриИзменении(Элемент)
	Элементы.ТабличныйДокумент.Защита = Не РедактированиеТаблицы;
	Элементы.ТабличныйДокумент.Редактирование = РедактированиеТаблицы
КонецПроцедуры

&НаКлиенте
Процедура НастройкаРежимПоискаПоРевизитамПриИзменении(Элемент) 
	Элементы.ГруппаКлючевыхРеквизитовОбъекта.Видимость = НастройкаРежимПоискаПоРевизитам;
	Элементы.ОбъектТекущейИБ.Видимость = Не НастройкаРежимПоискаПоРевизитам; 
	ОбновитьКлючевыеПолеПоиска();
	ОбновитьТаблицаПравилИспользованияПолей();
	ОбъектТекущейИБПриИзмененииНаСервере();
	ОбновитьЗаголовокКнопкиСформироватьОтчет();
КонецПроцедуры

#КонецОбласти

#Область СформироватьОтчет

&НаСервере
Процедура ОбновитьТаблицаПравилИспользованияПолей()
	
	ТаблицаПравилИспользованияПолей.Очистить();
	ТаблицаПравилИспользованияПолейСвязанныхОбъектов.Очистить();
	
	//Заполнение общей плоской таблицы правил, сгруппированной по ТипБД
	Если ТипЗнч(ТекущийПараметрОбменаНСИ) <> Тип("Строка") Тогда
		
		кэшТипБД1 = Неопределено;
		мСписокВнешнихИнформационныхБаз = СписокВнешнихИнформационныхБаз.Выгрузить().Скопировать(Новый Структура("Выбран", Истина));
		Для Каждого ЭлеменСписка Из мСписокВнешнихИнформационныхБаз Цикл 
			
			РабНастройкаСоответствия = ПолучитьЗначениеСоответствиеВнешнимИБ(ТекущийПараметрОбменаНСИ, ЭлеменСписка.ТипБД);
		    Если Не ЗначениеЗаполнено(РабНастройкаСоответствия) Тогда
		    	Продолжить;
			КонецЕсли;
			Если кэшТипБД1 <> ЭлеменСписка.ТипБД Тогда 
				ТабПравилаРабочие_Рек = ПодготовитьТаблицуПолейДляЗапроса(РабНастройкаСоответствия, ЭлеменСписка.ВнешняяИБ);	
				ТабПравилаРабочие_Рек.Колонки.Добавить("ТипБД", ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСсылка("СправочникСсылка.ТипыБазДанных"));
				ТабПравилаРабочие_Рек.ЗаполнитьЗначения(ЭлеменСписка.ТипБД, "ТипБД");
				//ТабПравилаРабочие.Колонки.Добавить("ПараметрОбменаНСИ", ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСсылка("СправочникСсылка.ПараметрыОбменаНСИ"));
				//ТабПравилаРабочие.ЗаполнитьЗначения(ТекущийПараметрОбменаНСИ, "ПараметрОбменаНСИ");
				ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТабПравилаРабочие_Рек, ТаблицаПравилИспользованияПолей);
				//---------------------
				Для Каждого сс Из РабНастройкаСоответствия.СоответствияСвязанныхОбъектов Цикл 
					
					нн = ТаблицаПравилИспользованияПолей.Добавить();
					нн.УровеньВложенности = 10;
					нн.РеквизитАналитики = сс.ОписаниеОбъектаВИБ.Имя;
					нн.Поле = нн.РеквизитАналитики;//сс.ОписаниеОбъектаВИБ;
					нн.ОписаниеОбъектаВИБ = сс.ОписаниеОбъектаВИБ;
					нн.ТипБД = ЭлеменСписка.ТипБД;
					нн.НеИспользоватьДляСинхронизации = Истина;
					
				//	Если кэшТипБД <> ЭлеменСписка.ТипБД Тогда 
						ТабПравилаРабочие_ТЧ = ПодготовитьТаблицуПолейДляЗапроса(сс.НастройкаСоответствия, ЭлеменСписка.ВнешняяИБ);	
			   	//	КонецЕсли;	
					
					//НН = сс.НастройкаСоответствия.ПолучитьОбъект(); сс.НастройкаСоответствия.ОписаниеОбъектаВИБ.Реквизиты
					//НН.ЗаполнитьСписокПолей();

					ТабПравилаРабочие_ТЧ.Колонки.Добавить("ТипБД", ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСсылка("СправочникСсылка.ТипыБазДанных"));
					ТабПравилаРабочие_ТЧ.ЗаполнитьЗначения(ЭлеменСписка.ТипБД, "ТипБД");
					ТабПравилаРабочие_ТЧ.Колонки.Добавить("ТипОбъектаТек", ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСтроки(100));
					ТабПравилаРабочие_ТЧ.ЗаполнитьЗначения(сс.ТипОбъектаТек, "ТипОбъектаТек");
					ТабПравилаРабочие_ТЧ.Колонки.Добавить("ОписаниеОбъектаВИБ", ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСсылка("СправочникСсылка.ТабличныеЧастиБД"));
					ТабПравилаРабочие_ТЧ.ЗаполнитьЗначения(сс.ОписаниеОбъектаВИБ, "ОписаниеОбъектаВИБ");
					ТабПравилаРабочие_ТЧ.Колонки.Добавить("ОписаниеПримитивногоТипа", ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСтроки(100));
					Для Каждого Описание Из сс.НастройкаСоответствия.ОписаниеОбъектаВИБ.Реквизиты Цикл 
						мСтрок = ТабПравилаРабочие_ТЧ.НайтиСтроки(Новый Структура("РеквизитАналитики", Описание.Имя));	
						Для Каждого м Из мСтрок Цикл 
							м.ОписаниеПримитивногоТипа = Описание.ОписаниеПримитивногоТипа;	
						КонецЦикла;	
					КонецЦикла;
					
					мТабПравилаРабочие = ТаблицаПравилИспользованияПолейСвязанныхОбъектов.НайтиСтроки(Новый Структура("ТипБД, ОписаниеОбъектаВИБ", ЭлеменСписка.ТипБД, сс.ОписаниеОбъектаВИБ));
					Если мТабПравилаРабочие.Количество() = 0  Тогда 
						ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТабПравилаРабочие_ТЧ, ТаблицаПравилИспользованияПолейСвязанныхОбъектов);
					КонецЕсли;

				КонецЦикла;
				//---------------------
			КонецЕсли;
			
			кэшТипБД1 = ЭлеменСписка.ТипБД;
		КонецЦикла;
		
	Иначе
		
		ТТ = ТаблицаПравилИспользованияПолей.Выгрузить();
		ТТ = ЗаполнитьПравилаИспользованияПолейПоУмолчанию(ТТ, ТекущийПараметрОбменаНСИ);
		ТаблицаПравилИспользованияПолей.Загрузить(ТТ);
		
	КонецЕсли;

	//Добавление поля GUID в каждую ТипБД
	ТабТипБД = ТаблицаПравилИспользованияПолей.Выгрузить();
	ТабТипБД.Свернуть("ТипБД");
	Для Каждого м Из ТабТипБД Цикл 
    	мСтрок = ТаблицаПравилИспользованияПолей.НайтиСтроки(Новый Структура("ТипБД", м.ТипБД));
		н = ТаблицаПравилИспользованияПолей.Добавить();
		ЗаполнитьЗначенияСвойств(н, мСтрок[0]);
		н.НеИспользоватьДляСинхронизации = Истина;
		н.КлючевоеПоле = Ложь;
		н.Поле = "GUID";
		н.РеквизитАналитики = н.Поле;
	КонецЦикла;	

	//Изменение ключевых полей
	Если НастройкаРежимПоискаПоРевизитам Тогда
	    мСтрок = ТаблицаПравилИспользованияПолей.НайтиСтроки(Новый Структура("НеИспользоватьДляСинхронизации", Ложь));
		Для Каждого м Из мСтрок Цикл 
			м.НеИспользоватьДляСинхронизации = Истина;
		КонецЦикла;	
		Для Каждого КлючевоеПоле Из СписокКлючевыхРеквизитов Цикл
			КлючевоеПолеИмя = СтрРазделить(КлючевоеПоле.Значение, "spr", Ложь)[1];
	    	мСтрок = ТаблицаПравилИспользованияПолей.НайтиСтроки(Новый Структура("РеквизитАналитики", КлючевоеПолеИмя));
			Для Каждого м Из мСтрок Цикл 
				м.НеИспользоватьДляСинхронизации = Не КлючевоеПоле.Пометка;
			КонецЦикла;	
		//	м.НеИспользоватьДляСинхронизации = Истина;
		КонецЦикла;	
	КонецЕсли;	   
	
	Если кешИмяОбъектаМетаданных = "БанковскиеСчета" Тогда 
		Для Каждого м Из ТабТипБД Цикл 
	    	мСтрок = ТаблицаПравилИспользованияПолей.НайтиСтроки(Новый Структура("ТипБД, РеквизитАналитики", м.ТипБД, "Банк.РучноеИзменение"));
			Если мСтрок.Количество() = 0 Тогда 
				НН = ТаблицаПравилИспользованияПолей.Добавить();		
				НН.РеквизитАналитики = "Банк.РучноеИзменение";
				НН.Поле = "Ссылка.Банк.РучноеИзменение";
				НН.ТаблицаАналитики = "Справочник.Банки";
				НН.ТаблицаАналитикиВИБ = "Справочник.Банки";
				НН.НастройкаСоответствияРеквизит = "Справочник.Банки -> Справочник.Банки";
				НН.ТипБД = м.ТипБД;
				НН.УровеньВложенности = 2;	
				НН.НеИспользоватьДляСинхронизации = Истина;
				
				НН = ТаблицаПравилИспользованияПолей.Добавить();		
				НН.РеквизитАналитики = "Банк.Наименование";
				НН.Поле = "Ссылка.Банк.Наименование";
				НН.ТаблицаАналитики = "Справочник.Банки";
				НН.ТаблицаАналитикиВИБ = "Справочник.Банки";
				НН.НастройкаСоответствияРеквизит = "Справочник.Банки -> Справочник.Банки";
				НН.ТипБД = м.ТипБД;
				НН.УровеньВложенности = 2;	
				НН.НеИспользоватьДляСинхронизации = Истина;	
			КонецЕсли;		
		КонецЦикла;
	КонецЕсли;
	
    ОбновитьТаблицаПравилИспользованияПолейОтражение();
	
КонецПроцедуры
	
Функция ПодготовитьТаблицуПолейДляЗапроса(РабНастройкаСоответствия, ВнешняяИБ)

	ПравилаИспользованияПолей = ПолучитьОписаниеТаблицыПравилаИспользованияПолей();

	ДанныеНастройки = ПолучитьДанныеНастройкиДляВыгрузки(РабНастройкаСоответствия);
	ДанныеНастройки.Вставить("ИспользуемаяИБ", ВнешняяИБ);
			
	НоваяСтрока = ПравилаИспользованияПолей.Добавить();
	НоваяСтрока.Поле = "Ссылка";
	НоваяСтрока.Синоним = "Элемент";
	НоваяСтрока.КодАналитики = СтрЗаменить(ДанныеНастройки.ТаблицаАналитикиВИБ, ".","_");
	НоваяСтрока.НастройкаСоответствия = РабНастройкаСоответствия;
	ТабПравилаРабочие = ИнтеграцияСВнешнимиСистемамиУХ.ПодготовитьТаблицуПолейДляЗапроса(ПравилаИспользованияПолей,Ложь,Истина,Ложь,Истина,Истина);
	
	Возврат ТабПравилаРабочие;
	
КонецФункции
  
//Создание кросс таблицы правил для отражения на форме, с колонками по каждой ТипБД
//
&НаСервере
Процедура ОбновитьТаблицаПравилИспользованияПолейОтражение()
	
	//	Создание реквизитов и элементов кросс таблицы 
	ТТ = ТаблицаПравилИспользованияПолей.Выгрузить().Скопировать();
	ТТ.Сортировать("ТипБД, НеИспользоватьДляСинхронизации");

	ТТ.Свернуть("УровеньВложенности, Поле");
	ТаблицаПравилИспользованияПолейОтражение.Загрузить(ТТ);
	
	МассивПолей = ТаблицаПравилИспользованияПолей.Выгрузить().ВыгрузитьКолонку("ТипБД");
	МассивПолей = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивПолей);
	
	ДобавляемыеРеквизиты = Новый Массив;
	ПутьКТаблице = "ТаблицаПравилИспользованияПолейОтражение";
	Реквизиты = ПолучитьРеквизиты(ПутьКТаблице);  
	Для Каждого Элемент Из Элементы.ТаблицаПравилИспользованияПолейОтражениеГруппаТипБД.ПодчиненныеЭлементы Цикл 
		Элемент.Видимость = Ложь;
	КонецЦикла;	
	Для Каждого ИмяРеквизита Из МассивПолей Цикл 
		Элемент = Элементы.ТаблицаПравилИспользованияПолейОтражениеГруппаТипБД.ПодчиненныеЭлементы.Найти(ИмяРеквизита);
		Если Элемент = Неопределено Тогда
			ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(ИмяРеквизита, ОбщегоНазначенияУХ.ПолучитьОписаниеТиповБулево(), ПутьКТаблице, ИмяРеквизита));
		Иначе 	
			Элемент.Видимость = Истина;
		КонецЕсли;            
	КонецЦикла;
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Для Каждого текРеквизит из ДобавляемыеРеквизиты Цикл	
		НовыйЭлемент = Элементы.Добавить(текРеквизит.Имя, Тип("ПолеФормы"), Элементы.ТаблицаПравилИспользованияПолейОтражениеГруппаТипБД);
		НовыйЭлемент.ПутьКДанным			= "ТаблицаПравилИспользованияПолейОтражение." + текРеквизит.Имя;
		НовыйЭлемент.Вид 					= ВидПоляФормы.ПолеФлажка;
	КонецЦикла;

	//	Заполнение кросс таблицы 
	ТТ = ТаблицаПравилИспользованияПолей.Выгрузить().Скопировать();
	ТТ.Сортировать("НеИспользоватьДляСинхронизации");
	Для Каждого т Из ТТ Цикл	
		мСтрок = ТаблицаПравилИспользованияПолейОтражение.НайтиСтроки(Новый Структура("УровеньВложенности, Поле", т.УровеньВложенности, т.Поле));
		Для Каждого м Из мСтрок Цикл 
			м.Выбран = Истина;		
			м.КлючевоеПоле = Не т.НеИспользоватьДляСинхронизации;
			Для Каждого Поле Из МассивПолей Цикл 
				Если Поле = т.ТипБД Тогда
					м[Строка(Поле)] = Истина;
					м.РеквизитАналитики = т.РеквизитАналитики;
					м.ТаблицаАналитикиВИБ  = т.ТаблицаАналитикиВИБ;
					м.ОписаниеОбъектаВИБ  = т.ОписаниеОбъектаВИБ;
				КонецЕсли;	
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого т Из ТаблицаПравилИспользованияПолей Цикл	
		мПоле = СтрРазделить(т.Поле, ".");
		Если мПоле.Количество() = 2 Тогда
			т.Поле = мПоле[1];		
		ИначеЕсли мПоле.Количество() = 3 Тогда	
			т.Поле = мПоле[1] + "." + мПоле[2];		
		КонецЕсли;	
	КонецЦикла;	
	Для Каждого т Из ТаблицаПравилИспользованияПолейОтражение Цикл	
		мПоле = СтрРазделить(т.Поле, ".");
		Если мПоле.Количество() = 2 Тогда
			т.Поле = мПоле[1];		
		ИначеЕсли мПоле.Количество() = 3 Тогда	
			т.Поле = мПоле[1] + "." + мПоле[2];		
		КонецЕсли;	
	КонецЦикла;	
    ТаблицаПравилИспользованияПолейОтражение.Сортировать("КлючевоеПоле Убыв, УровеньВложенности, Поле");
КонецПроцедуры

Процедура ОбновитьКлючевыеПолеПоиска()
	
	СтруктураПоиска = Новый Структура("НеИспользоватьДляСинхронизации, НастройкаСоответствия", Ложь, СоответствиеВнешнимИБ);
	//Для Каждого Элемент Из СписокКлючевыхРеквизитов Цикл 
	//	Элемент.Пометка = Ложь;	
	//КонецЦикла;	
    ТаблицаПравил = ТаблицаПравилИспользованияПолей.Выгрузить();
	// особый режим ИНН/КПП
	Если кешИмяОбъектаМетаданных = "Контрагенты" Тогда 
		Если НастройкаРежимПоискаПоРевизитам Тогда 
			Макет = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("Правила_Контрагенты_КлючевыеПоляИННКПП");
			ПостроительЗапроса = Новый ПостроительЗапроса;
			ПостроительЗапроса.ИсточникДанных = Новый ОписаниеИсточникаДанных(Макет.Область());
			ПостроительЗапроса.Выполнить();
			ТаблицаПравил1 = ПостроительЗапроса.Результат.Выгрузить();
			ТаблицаПравил.Очистить();
			Для Каждого м Из ТаблицаПравил1 Цикл 
				т = ТаблицаПравил.Добавить();
				ЗаполнитьЗначенияСвойств(т, м);
				т.НастройкаСоответствия = СоответствиеВнешнимИБ;
				т.Выбран = ?(м.Выбран= "Истина", Истина, Ложь);
				т.КлючевоеПоле = ?(м.КлючевоеПоле= "Истина", Истина, Ложь);
				
				т.НеИспользоватьДляСинхронизации = ?(НастройкаРежимПоискаКонтрагентовПоИНН, т.НеИспользоватьДляСинхронизации, Не т.НеИспользоватьДляСинхронизации);
				т.КлючевоеПоле = ?(НастройкаРежимПоискаКонтрагентовПоИНН, т.КлючевоеПоле, Не т.КлючевоеПоле);
			КонецЦикла;
			СтруктураПоиска = Новый Структура("НастройкаСоответствия", СоответствиеВнешнимИБ); // макет вручную устанавливаемых ключей содержит не все поля, а только необходимые записи
		Иначе 
		КонецЕсли;
	КонецЕсли;	
	МассивПолей = ТаблицаПравил.НайтиСтроки(СтруктураПоиска);
	МассивПолей = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивПолей);
	
	Для Каждого КлючевоеПоле Из МассивПолей Цикл
		Если КлючевоеПоле.УровеньВложенности > 1 И Не ЗначениеЗаполнено(КлючевоеПоле.НастройкаСоответствияРеквизит) Тогда 
			Продолжить;	
		КонецЕсли;	
		КлючевоеПолеИмя = СтрЗаменить(КлючевоеПоле.ТаблицаАналитикиВИБ, ".", "") + "spr" + СтрЗаменить(КлючевоеПоле.РеквизитАналитики, ".", "dot");
		Если Элементы.Найти(КлючевоеПолеИмя) = Неопределено Тогда 
			СписокКлючевыхРеквизитов.Добавить(КлючевоеПолеИмя, ТекущийПараметрОбменаНСИ.ОписаниеОбъектаМетаданных.ИмяОбъектаМетаданных, Истина);
		КонецЕсли;	
		Если СписокКлючевыхРеквизитов.НайтиПоЗначению(КлючевоеПолеИмя) <> Неопределено Тогда 
			СписокКлючевыхРеквизитов.НайтиПоЗначению(КлючевоеПолеИмя).Пометка = КлючевоеПоле.КлючевоеПоле;
		КонецЕсли;	
	КонецЦикла; 
	
    ОбновитьКлючевыеПолеПоискаОтражение();
	
КонецПроцедуры

Процедура ОбновитьКлючевыеПолеПоискаОтражение()
	
	Элементы.НастройкаРежимПоискаКонтрагентовПоИНН.Видимость = НастройкаРежимПоискаПоРевизитам;
	ДобавляемыеРеквизиты = Новый Массив;

	Реквизиты = ПолучитьРеквизиты();
	Для Каждого КлючевоеПоле Из Реквизиты Цикл
	    Если Лев(КлючевоеПоле.Имя, 10) = "Справочник" Тогда 
			Элементы[КлючевоеПоле.Имя].Видимость = Ложь;           
		КонецЕсли;
	КонецЦикла;	

	ЭтаФорма.ИзменитьРеквизиты(, ДобавляемыеРеквизиты);

	Для Каждого Элемент Из СписокКлючевыхРеквизитов Цикл
		КлючевоеПолеИмя = Элемент.Значение;
		Если Элементы.Найти(КлючевоеПолеИмя) = Неопределено Тогда 
			ДобавляемыеРеквизиты.Очистить();
			НовыйКлючевоеПоле = Новый РеквизитФормы(КлючевоеПолеИмя, Новый ОписаниеТипов("Строка"));
			ДобавляемыеРеквизиты.Добавить(НовыйКлючевоеПоле);
			ИзменитьРеквизиты(ДобавляемыеРеквизиты);
			НовыйЭлемент = Элементы.Добавить(КлючевоеПолеИмя, Тип("ПолеФормы"), Элементы.ГруппаКлючевыхРеквизитовОбъекта);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = КлючевоеПолеИмя;
			НовыйЭлемент.Заголовок = СтрРазделить(Элемент.Значение, "spr", Ложь)[1];
		КонецЕсли;	
		Элементы[КлючевоеПолеИмя].Видимость = Элемент.Пометка;
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчет_ПоРеквизитам(ПоместитьВоВременноеХранилище = Ложь)
	
	Если НастройкаРежимПоискаПоРевизитам Тогда  // Подмена ОбъектТекущейИБ на структуру, с данными из формы 
		ОбъектТекущейИБСтруктура = Новый Структура();
		МассивКлючевыхПолей = Новый Массив();
		Для Каждого Элемент Из СписокКлючевыхРеквизитов Цикл
			Если Элемент.Представление = кешИмяОбъектаМетаданных Тогда 
				ОбъектТекущейИБСтруктура.Вставить(СтрРазделить(Элемент.Значение, "spr", Ложь)[1], ЭтотОбъект[Элемент.Значение]);
			КонецЕсли;	
		КонецЦикла;  
		мОбъектТекущейИБ = ОбъектТекущейИБСтруктура;
	Иначе 
		мОбъектТекущейИБ = ОбъектТекущейИБ;
	КонецЕсли;	
	
	ТаблицаРезультат_0 = Неопределено;
	ТаблицаРезультат_1 = Неопределено;
	
	Для Каждого ЭлеменСписка Из СписокВнешнихИнформационныхБаз Цикл 
		Если ЭлеменСписка.Выбран Тогда
						
			СписокПолей = Новый СписокЗначений; //Список где Значение и Представление используется для сборки запроса. Пометка - поле используется как условие
		    ТабПравилаРабочие = ТаблицаПравилИспользованияПолей.Выгрузить().Скопировать(Новый Структура("ТипБД", ?(ЭлеменСписка.ТипБД.Пустая(), Справочники.ТипыБазДанных.НайтиПоНаименованию("Бухгалтерия"), ЭлеменСписка.ТипБД)));
			СтруктураПараметровЗапроса = Новый Структура;
			
			ТаблицаАналитикиВИБ = ТабПравилаРабочие[0].ТаблицаАналитикиВИБ;
			ТаблицаАналитики = ТабПравилаРабочие[0].ТаблицаАналитики;
			
			СоздатьОписаниеПолей(ТабПравилаРабочие, СписокПолей, СтруктураПараметровЗапроса, ТаблицаАналитики, мОбъектТекущейИБ);		
			ТекстЗапроса = СобратьТекстЗапроса_Рек(СписокПолей, ТаблицаАналитикиВИБ);
			
		    ТабПравилаРабочие = ТаблицаПравилИспользованияПолейСвязанныхОбъектов.Выгрузить().Скопировать(Новый Структура("ТипБД", ЭлеменСписка.ТипБД));
			ТекстЗапроса_ТЧ = СобратьТекстЗапроса_ТЧ(СписокПолей, ТабПравилаРабочие, ТаблицаАналитикиВИБ);
			//--------------
			Если ТекущийПараметрОбменаНСИ = "Пользователи" Тогда
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ГДЕ", 
				"ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОПользователях КАК СведенияОПользователях
				|ПО СведенияОПользователях.Пользователь = Т.Ссылка"
				+ Символы.ПС
				+ "ГДЕ");
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Т.ПользовательОС", "СведенияОПользователях.ПользовательОС");
				ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ОбъектТекущейИБ.ИдентификаторПользователяИБ); 
				Если ПользовательИБ = Неопределено Тогда 
					Сообщить("Для пользователя не задан способ аутенфикации, поиск по полю ПользовательОС невозможен");
					Возврат;
				КонецЕсли;	
				СтруктураПараметровЗапроса.ПользовательОС = ПользовательИБ.ПользовательОС;
			КонецЕсли;
			//--------------
			Если ЭлеменСписка.ТекущаяИБ Тогда 
				Запрос = Новый Запрос;
				Запрос.Текст = ТекстЗапроса;
				Для Каждого Элемент Из СтруктураПараметровЗапроса Цикл
					Запрос.УстановитьПараметр(Элемент.Ключ, Элемент.Значение);
				КонецЦикла;	
				РезультатЗапроса = Запрос.Выполнить().Выгрузить();
				
				Если ПустаяСтрока(ТекстЗапроса_ТЧ) Тогда 
					РезультатЗапроса_СвязанныхОбъектов = Новый ТаблицаЗначений();
				Иначе	
					Запрос.Текст = ТекстЗапроса_ТЧ;
					Для Каждого Элемент Из СтруктураПараметровЗапроса Цикл
						Запрос.УстановитьПараметр(Элемент.Ключ, Элемент.Значение);
					КонецЦикла;	
					РезультатЗапроса_СвязанныхОбъектов = Запрос.Выполнить().Выгрузить();
				КонецЕсли;
			Иначе 	
				ТекСоединениеВИБ = УправлениеСоединениямиВИБУХ.ПолучитьСоединение(ЭлеменСписка.ВнешняяИБ, 1);		
				Если ТекСоединениеВИБ = Неопределено Тогда
					Сообщить("Ошибка соединения с базой " + ЭлеменСписка.ВнешняяИБ);
					ЭлеменСписка.ФлагОшибкаСоединения = Истина;
					ЭлеменСписка.Выбран = Ложь;
				Иначе 	
					ДанныеЗапроса = ПодготовитьДанныеЗапроса(ТекстЗапроса, ТаблицаПравилИспользованияПолей[0].ТаблицаАналитикиВИБ,, СтруктураПараметровЗапроса);				
					ТаблицаДанных = ТекСоединениеВИБ.GetWorkingDataTable(Новый ХранилищеЗначения(ДанныеЗапроса, Новый СжатиеДанных(9))).Получить(); 
					ЭлеменСписка.ФлагОшибкаСоединения = Ложь;
					Если ТипЗнч(ТаблицаДанных) = Тип("Структура") Тогда 
						НайденОбъектВнешнейБДПоСсылке = Истина;	
						РезультатЗапроса = ТаблицаДанных.ТаблицаПереноса.Скопировать();
					Иначе 	
						РезультатЗапроса = Новый ТаблицаЗначений();
					КонецЕсли;

					Если ПустаяСтрока(ТекстЗапроса_ТЧ) Тогда 
						РезультатЗапроса_СвязанныхОбъектов = Новый ТаблицаЗначений();
					Иначе 	
						ДанныеЗапроса = ПодготовитьДанныеЗапроса(ТекстЗапроса_ТЧ, ТаблицаПравилИспользованияПолей[0].ТаблицаАналитикиВИБ,, СтруктураПараметровЗапроса);				
						ТаблицаДанных = ТекСоединениеВИБ.GetWorkingDataTable(Новый ХранилищеЗначения(ДанныеЗапроса, Новый СжатиеДанных(9))).Получить(); 
						Если ТипЗнч(ТаблицаДанных) = Тип("Структура") Тогда 
							РезультатЗапроса_СвязанныхОбъектов = ТаблицаДанных.ТаблицаПереноса.Скопировать();
						Иначе 	
							РезультатЗапроса_СвязанныхОбъектов.Очистить();
						КонецЕсли;
					КонецЕсли;	

				КонецЕсли;
			КонецЕсли;
			
			Если ЭлеменСписка.ФлагОшибкаСоединения Тогда 
				Продолжить;
			КонецЕсли;
		//	Попытка
				РезультатЗапроса.Колонки.Добавить("ВнешняяИБ", ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСсылка("СправочникСсылка.ВнешниеИнформационныеБазы"));
				РезультатЗапроса.Колонки.Добавить("ПустойРезультат", ОбщегоНазначенияУХ.ПолучитьОписаниеТиповБулево());   
				РезультатЗапроса_СвязанныхОбъектов.Колонки.Добавить("ВнешняяИБ", ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСсылка("СправочникСсылка.ВнешниеИнформационныеБазы"));
				РезультатЗапроса_СвязанныхОбъектов.Колонки.Добавить("ПустойРезультат", ОбщегоНазначенияУХ.ПолучитьОписаниеТиповБулево());   
			//Исключение
			//КонецПопытки;
			Если РезультатЗапроса.Количество() = 0 Тогда
				н = РезультатЗапроса.Добавить(); 
				н.ПустойРезультат = Истина;
			//	н.АВТОНОМЕРЗАПИСИ = 0;				
			КонецЕсли;	
			Если РезультатЗапроса_СвязанныхОбъектов.Количество() = 0 Тогда
				н = РезультатЗапроса_СвязанныхОбъектов.Добавить(); 
				н.ПустойРезультат = Истина;
			//	н.АВТОНОМЕРЗАПИСИ = 0;				
			КонецЕсли;	
			РезультатЗапроса.ЗаполнитьЗначения(ЭлеменСписка.ВнешняяИБ, "ВнешняяИБ");
			РезультатЗапроса_СвязанныхОбъектов.ЗаполнитьЗначения(ЭлеменСписка.ВнешняяИБ, "ВнешняяИБ");
			Если ТаблицаРезультат_0 = Неопределено Тогда 				
				ТаблицаРезультат_0 = РезультатЗапроса.Скопировать(); 	
			Иначе 	                        
				РасширитьКолонкиТаблицы(РезультатЗапроса, ТаблицаРезультат_0); //результат в разных БД может иметь разный набор колонок
				ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(РезультатЗапроса, ТаблицаРезультат_0);
			КонецЕсли;
			Если ТаблицаРезультат_1 = Неопределено Тогда 				
				ТаблицаРезультат_1 = РезультатЗапроса_СвязанныхОбъектов.Скопировать(); 	
			Иначе 	                        
				РасширитьКолонкиТаблицы(РезультатЗапроса_СвязанныхОбъектов, ТаблицаРезультат_1); 
				ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(РезультатЗапроса_СвязанныхОбъектов, ТаблицаРезультат_1);
			КонецЕсли;
			
		КонецЕсли;	
	КонецЦикла;		
	
	Если ПоместитьВоВременноеХранилище Тогда 
		АдресДанныхОбъекта_Рек = ПоместитьВоВременноеХранилище(ТаблицаРезультат_0, Новый УникальныйИдентификатор());
	Иначе 
		ТаблицаСоответствий = ПолучитьТаблицуСоответствиеОбъектовТекущейИВнешнихИБ(ТаблицаРезультат_0);
		ВывестиТабличныйДокумент(ТаблицаПравилИспользованияПолейОтражение, ТаблицаПравилИспользованияПолейСвязанныхОбъектов.Выгрузить(), ТаблицаРезультат_0, ТаблицаРезультат_1, ТаблицаСоответствий);
	КонецЕсли;

КонецПроцедуры 

&НаСервере
Процедура СформироватьОтчет_ПоGUID(ВнешняяИБ, GUIDвнешнейСсылки = Неопределено, НайденОбъектВнешнейБДПоСсылке, ПоместитьВоВременноеХранилище = Ложь)
	
	ТипБД = ВнешняяИБ.ТипБД;
	
	ТаблицаРезультат_0 = Неопределено;
		
	ТекСоединениеВИБ = УправлениеСоединениямиВИБУХ.ПолучитьСоединение(ВнешняяИБ, 1);		
	Если ТекСоединениеВИБ = Неопределено Тогда
		//Сообщить("Ошибка соединения с базой " + ЭлеменСписка.ВнешняяИБ);
		//ЭлеменСписка.ФлагОшибкаСоединения = Истина;
	Иначе 
		Если GUIDвнешнейСсылки = Неопределено Тогда 
	  		Поз2 = Найти(_URL, "?ref=");
			GUIDвнешнейСсылки = ПолучитьGUIDПоНавигационнойСсылке(Сред(_URL, Поз2 + 5));
		КонецЕсли;

		СписокПолей = Новый СписокЗначений; //Общий для сборки запроса и вывода таблицы
	    ТабПравилаРабочие = ТаблицаПравилИспользованияПолей.Выгрузить().Скопировать(Новый Структура("ТипБД", ТипБД));
		СтруктураПараметровЗапроса = Новый Структура;
		
		ТаблицаАналитикиВИБ = ТабПравилаРабочие[0].ТаблицаАналитикиВИБ;
		ТаблицаАналитики = ТабПравилаРабочие[0].ТаблицаАналитики;
		
		СоздатьОписаниеПолей(ТабПравилаРабочие, СписокПолей, СтруктураПараметровЗапроса, ТаблицаАналитики, ?(GUIDвнешнейСсылки = Неопределено, ОбъектТекущейИБ, Неопределено));			
		ТекстЗапроса = СобратьТекстЗапроса_Рек(СписокПолей, ТаблицаАналитикиВИБ, Истина);	
		
		ТабПравилаРабочие = ТаблицаПравилИспользованияПолейСвязанныхОбъектов.Выгрузить().Скопировать(Новый Структура("ТипБД", ТипБД));
		ТекстЗапроса_ТЧ = СобратьТекстЗапроса_ТЧ(СписокПолей, ТабПравилаРабочие, ТаблицаАналитикиВИБ, Истина);

		ДанныеЗапроса = ПодготовитьДанныеЗапроса(ТекстЗапроса, ТаблицаПравилИспользованияПолей[0].ТаблицаАналитикиВИБ, GUIDвнешнейСсылки);				
		ТаблицаДанных_0 = ТекСоединениеВИБ.GetWorkingDataTable(Новый ХранилищеЗначения(ДанныеЗапроса, Новый СжатиеДанных(9))).Получить(); 
		Если Не ПустаяСтрока(ТекстЗапроса_ТЧ) Тогда 
			ДанныеЗапроса = ПодготовитьДанныеЗапроса(ТекстЗапроса_ТЧ, ТаблицаПравилИспользованияПолей[0].ТаблицаАналитикиВИБ, GUIDвнешнейСсылки);				
			ТаблицаДанных_1 = ТекСоединениеВИБ.GetWorkingDataTable(Новый ХранилищеЗначения(ДанныеЗапроса, Новый СжатиеДанных(9))).Получить(); 
		КонецЕсли;		
		Если ТипЗнч(ТаблицаДанных_0) = Тип("Структура") Тогда 
			НайденОбъектВнешнейБДПоСсылке = Истина;	
			ТаблицаРезультат_0 = ТаблицаДанных_0.ТаблицаПереноса.Скопировать();
			ТаблицаРезультат_0.Колонки.Добавить("ВнешняяИБ", ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСсылка("СправочникСсылка.ВнешниеИнформационныеБазы"));
			ТаблицаРезультат_0.ЗаполнитьЗначения(ВнешняяИБ, "ВнешняяИБ");
		//	АдресДанныхОбъекта_Рек = ПоместитьВоВременноеХранилище(ТаблицаРезультат_0, Новый УникальныйИдентификатор());
		КонецЕсли;
		Если ТипЗнч(ТаблицаДанных_1) = Тип("Структура") Тогда 
			ТаблицаРезультат_1 = ТаблицаДанных_1.ТаблицаПереноса.Скопировать();
			ТаблицаРезультат_1.Колонки.Добавить("ВнешняяИБ", ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСсылка("СправочникСсылка.ВнешниеИнформационныеБазы"));
			ТаблицаРезультат_1.ЗаполнитьЗначения(ВнешняяИБ, "ВнешняяИБ");
		//	АдресДанныхОбъекта_ТЧ = ПоместитьВоВременноеХранилище(ТаблицаРезультат_1, Новый УникальныйИдентификатор());
		КонецЕсли;
		
		ТаблицаРезультат_0.Колонки.Добавить("ПустойРезультат", ОбщегоНазначенияУХ.ПолучитьОписаниеТиповБулево());
		
		// заполнение ключевых полей поиска
	//	ИмяОбъектаМетаданных = ТекущийПараметрОбменаНСИ.ОписаниеОбъектаМетаданных.ИмяОбъектаМетаданных;
		Для Каждого Элемент Из СписокКлючевыхРеквизитов Цикл 
			Если Элемент.Представление = кешИмяОбъектаМетаданных Тогда 
				мКлючевойРеквизит = СтрРазделить(Элемент.Значение, "spr", Ложь);
				ЭтотОбъект[Элемент.Значение] = ТаблицаРезультат_0[0][мКлючевойРеквизит[1]];
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если ПоместитьВоВременноеХранилище Тогда 
		АдресДанныхОбъекта_Рек = ПоместитьВоВременноеХранилище(ТаблицаРезультат_0, Новый УникальныйИдентификатор());
	Иначе 
		ТаблицаСоответствий = ПолучитьТаблицуСоответствиеОбъектовТекущейИВнешнихИБ(ТаблицаРезультат_0);
		ВывестиТабличныйДокумент(ТаблицаПравилИспользованияПолейОтражение, ТаблицаПравилИспользованияПолейСвязанныхОбъектов.Выгрузить(), ТаблицаРезультат_0, ТаблицаРезультат_1, ТаблицаСоответствий);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиТабличныйДокумент(ТаблицаПравилИспользованияПолей, ТаблицаПравилИспользованияПолейСвязанныхОбъектов, ТаблицаРезультат_0, ТаблицаРезультат_1 = Неопределено, ТаблицаСоответствий)
	
	ТекущаяИБ = Справочники.ВнешниеИнформационныеБазы.ТекущаяИБ;
	
	Макет = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("Макет");
	ОбластьШапкаУровень = Макет.ПолучитьОбласть("ДеталиШапка|Уровень");
	ОбластьУровень = Макет.ПолучитьОбласть("Детали|Уровень");
	ОбластьДетали = Макет.ПолучитьОбласть("Детали|Колонка");
	ОбластьШапка = Макет.ПолучитьОбласть("ДеталиШапка|Колонка");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("ДеталиШапка|Заголовок");
	ШрифтОбычный = ОбластьДетали.ТекущаяОбласть.Шрифт;
	ШрифтЖирный = Новый Шрифт(ШрифтОбычный,,,истина);
	ЦветФонаБелый = WebЦвета.Белый;
	ЦветФонаРозовый = WebЦвета.СветлоРозовый;
	ЦветФонаСерый = WebЦвета.Льняной;
	ЦветФонаЗеленый = WebЦвета.СветлоЗеленый;
	
	ТабличныйДокумент.Очистить();
	ОбластьЗаголовок.Параметры.Текст = "Сравнение реквизитов внешних ИБ на дату: " + ТекущаяДатаСеанса();
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
	ОбластьШапкаУровень.Параметры.Текст = "Уровень";
	ТабличныйДокумент.Вывести(ОбластьШапкаУровень); 
	ОбластьШапка.Параметры.Текст = "Имя реквизита";
	ТабличныйДокумент.Присоединить(ОбластьШапка); 
	мВнешняяИБ = ТаблицаРезультат_0.Скопировать(, "ВнешняяИБ, АВТОНОМЕРЗАПИСИ, GUID");
    мВнешняяИБ.Свернуть("ВнешняяИБ, АВТОНОМЕРЗАПИСИ, GUID");
	
	Для Каждого м Из мВнешняяИБ Цикл 
		ОбластьШапка.Параметры.Текст = м.ВнешняяИБ;
	//	ОбластьШапка.Параметры.Расшифровка = м.ВнешняяИБ;		
		ТабличныйДокумент.Присоединить(ОбластьШапка);
	КонецЦикла;
	
	ОбластьДетали.Параметры.Текст = "";
	ТабличныйДокумент.Вывести(ОбластьДетали); 
	ОбластьДетали.Параметры.Текст = "Есть запись в рег. соответствие";
	ТабличныйДокумент.Присоединить(ОбластьДетали); 

	Для Каждого м Из мВнешняяИБ Цикл 
		ОбластьДетали.Параметры.Текст = ?(м.ВнешняяИБ = ТекущаяИБ, "-", ТаблицаСоответствий.НайтиСтроки(Новый Структура("ВнешняяИБ", м.ВнешняяИБ))[0].ЕстьЗаписьСоответствия);
		ОбластьДетали.Параметры.Расшифровка = "#" + м.ВнешняяИБ + ";" + ОбластьДетали.Параметры.Текст + ";" + м.GUID;		
		тОбласть = ТабличныйДокумент.Присоединить(ОбластьДетали);
		тОбласть.ЦветФона = ?(ОбластьДетали.Параметры.Текст = Истина, ЦветФонаЗеленый, ЦветФонаБелый);

		//мВыбран = СписокВнешнихИнформационныхБаз.НайтиСтроки(Новый Структура("ВнешняяИБ", м.ВнешняяИБ));
		//Если м.ВнешняяИБ <> ТекущаяИБ И мВыбран[0].ЕстьСсылка <> ОбластьДетали.Параметры.Текст Тогда 
		//	тОбласть.ЦветФона = ЦветФонаРозовый;
		//Иначе 	
		//	тОбласть.ЦветФона = ?(ОбластьДетали.Параметры.Текст = Истина, ЦветФонаЗеленый, ЦветФонаБелый);
		//КонецЕсли;	
	КонецЦикла;
	
	//	ТабличныйДокумент.НачатьГруппуСтрок();		
	Для Каждого Правило Из ТаблицаПравилИспользованияПолей Цикл 
		
		Если Правило.УровеньВложенности < 10 Тогда 
			ОбластьУровень.Параметры.Текст = Правило.УровеньВложенности;	
			ТабличныйДокумент.Вывести(ОбластьУровень); 
			ОбластьДетали.Параметры.Текст = Правило.Поле;	
			тОбласть = ТабличныйДокумент.Присоединить(ОбластьДетали);
			тОбласть.Шрифт = ?(Правило.КлючевоеПоле, ШрифтЖирный, ШрифтОбычный);
			тОбласть.ЦветФона = ЦветФонаБелый;

			кешЗначение = Неопределено;
			текЗначение = Неопределено;
			Для Каждого м Из мВнешняяИБ Цикл 
				мТипБД = м.ВнешняяИБ.ТипБД;
				мТипБД = ?(мТипБД.Пустая(), Справочники.ТипыБазДанных.НайтиПоНаименованию("Бухгалтерия"), мТипБД);
	            РезультатЗапроса = ТаблицаРезультат_0.Скопировать(Новый Структура("ВнешняяИБ, АВТОНОМЕРЗАПИСИ", м.ВнешняяИБ, м.АВТОНОМЕРЗАПИСИ));
				Для Каждого тЗначениеВыборки Из РезультатЗапроса Цикл 
					Если Правило[Строка(мТипБД)] Тогда 
			            Попытка
							текЗначение = тЗначениеВыборки[СтрЗаменить(Правило.Поле, ".", "_")];
						Исключение
							текЗначение = "<>";
						КонецПопытки;
					Иначе		
						текЗначение = "—";
					КонецЕсли;	
					ОбластьДетали.Параметры.Текст = текЗначение;
					ОбластьДетали.Параметры.Расшифровка = "e1cib/data/" + Правило.ТаблицаАналитикиВИБ + "?ref=" + ПолучитьНавигационнуюСсылкуПоGUID(тЗначениеВыборки.GUID);
					тОбласть = ТабличныйДокумент.Присоединить(ОбластьДетали);
					Если Правило.Поле = "GUID" И Строка(кешЗначение) = Строка(текЗначение) И текЗначение <> Неопределено Тогда
						тОбласть = ТабличныйДокумент.Область(тОбласть.Верх, тОбласть.Лево - 1, тОбласть.Верх, тОбласть.Лево);
						тОбласть.ЦветФона = ЦветФонаЗеленый;
					ИначеЕсли Строка(кешЗначение) = Строка(текЗначение) ИЛИ кешЗначение = Неопределено ИЛИ текЗначение = "—" ИЛИ тЗначениеВыборки.ПустойРезультат Тогда
						тОбласть.Шрифт = ?(Правило.КлючевоеПоле, ШрифтЖирный, ШрифтОбычный);
					Иначе 	
						тОбласть.ЦветФона = ЦветФонаРозовый;
					КонецЕсли;
					Если Не тЗначениеВыборки.ПустойРезультат Тогда 
						кешЗначение = текЗначение;                     
					КонецЕсли;
				КонецЦикла;
		
			КонецЦикла;
		ИначеЕсли НастройкаВыводитьТабличныеЧасти Тогда 
			
			ОбластьУровень.Параметры.Текст = Правило.УровеньВложенности;	
			ТабличныйДокумент.Вывести(ОбластьУровень); 
			ОбластьДетали.Параметры.Текст = Правило.Поле;	
			тОбласть = ТабличныйДокумент.Присоединить(ОбластьДетали);
			тОбласть.ЦветФона = ЦветФонаСерый;

			Для Каждого м1 Из мВнешняяИБ Цикл 
				ОбластьДетали.Параметры.Текст = "";	
				тОбласть = ТабличныйДокумент.Присоединить(ОбластьДетали);
				тОбласть.ЦветФона = ЦветФонаСерый;
			КонецЦикла;	

			ТабличныйДокумент.НачатьГруппуСтрок();	//ОписаниеОбъектаВИБ	
			ТаблицаПравилИспользованияПолей_1 = ТаблицаПравилИспользованияПолейСвязанныхОбъектов.Скопировать(Новый Структура("ОписаниеОбъектаВИБ", Правило.ОписаниеОбъектаВИБ));
			ТаблицаПравилИспользованияПолей_1.Свернуть("Поле, УровеньВложенности");
			Для Каждого Правило_1 Из ТаблицаПравилИспользованияПолей_1 Цикл 
				//Если РезультатЗапроса[0].ПустойРезультат Тогда 
				//	Продолжить;
				//КонецЕсли;	
	            РезультатЗапроса_1 = ТаблицаРезультат_1.Скопировать(Новый Структура("ТаблицаАналитики", "ТабличнаяЧасть." + Правило.Поле));
				РезультатЗапроса_1.Сортировать("АВТОНОМЕРЗАПИСИ Убыв");
				МаксКоличество = ?(РезультатЗапроса_1.Количество(), РезультатЗапроса_1[0].АВТОНОМЕРЗАПИСИ, 0);
				
				Для А = 1 По МаксКоличество Цикл  
			
					ОбластьУровень.Параметры.Текст = Правило_1.УровеньВложенности;	
					тОбласть = ТабличныйДокумент.Вывести(ОбластьУровень); 
					тОбласть.ОтступСлева = 1;
					ОбластьДетали.Параметры.Текст = СтрЗаменить(Правило_1.Поле, "Ссылка.", "") + ?(МаксКоличество > 1, " " + А, "");	
					тОбласть = ТабличныйДокумент.Присоединить(ОбластьДетали); 
					тОбласть.ОтступСлева = 1;

					кешЗначение = Неопределено;
					текЗначение = Неопределено;
					Для Каждого м1 Из мВнешняяИБ Цикл 
			            РезультатЗапроса = ТаблицаРезультат_0.Скопировать(Новый Структура("ВнешняяИБ, АВТОНОМЕРЗАПИСИ", м1.ВнешняяИБ, м1.АВТОНОМЕРЗАПИСИ));
						Для Каждого тЗначениеВыборки Из РезультатЗапроса Цикл 
				            РезультатЗапроса_11 = РезультатЗапроса_1.Скопировать(Новый Структура("ВнешняяИБ, GUID, АВТОНОМЕРЗАПИСИ", м1.ВнешняяИБ, тЗначениеВыборки.GUID, А));
							текЗначение = "";
							Для Каждого тЗначениеВыборки_11 Из РезультатЗапроса_11 Цикл 
								текЗначение = тЗначениеВыборки_11[СтрЗаменить(СтрЗаменить(Правило_1.Поле, "Ссылка.", Правило.Поле + "_"), ".", "_")];
							КонецЦикла;
							ОбластьДетали.Параметры.Текст = текЗначение;
							тОбласть = ТабличныйДокумент.Присоединить(ОбластьДетали);
							
							Если Строка(кешЗначение) = Строка(текЗначение) ИЛИ кешЗначение = Неопределено ИЛИ текЗначение = "—" ИЛИ тЗначениеВыборки.ПустойРезультат Тогда
							Иначе 	
								тОбласть.ЦветФона = ЦветФонаРозовый;
							КонецЕсли;
							Если Не тЗначениеВыборки.ПустойРезультат Тогда 
								кешЗначение = текЗначение;                     
							КонецЕсли;
							
						КонецЦикла;
					КонецЦикла; 
					
				КонецЦикла;

			КонецЦикла;
			ТабличныйДокумент.ЗакончитьГруппуСтрок();
		КонецЕсли;		
	КонецЦикла;  

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СоздатьОписаниеПолей(ТабПравилаРабочие, СписокПолей, СтруктураПараметровЗапроса, ТаблицаАналитики, мЭлементСравнения)
	
	ТабПравилаРабочие.Сортировать("УровеньВложенности, НеИспользоватьДляСинхронизации");
	Для Каждого Правило Из ТабПравилаРабочие Цикл  
				
		Если Правило.УровеньВложенности = 10 Тогда 
			Продолжить;
		КонецЕсли;
		ПредставлениеПараметра = СтрЗаменить(Правило.Поле, ".", "_"); 		
		Если Правило.НеИспользоватьДляСинхронизации	= Ложь Тогда 
			
			Если Правило.НастройкаСоответствия.СинхронизацияПоGUID Тогда 
			ИначеЕсли НастройкаРежимПоискаПоРевизитам Тогда 
				Если мЭлементСравнения = Неопределено Тогда 
					ЗначениеПараметра = Неопределено;	
				Иначе 	
					ЗначениеПараметра = мЭлементСравнения[ПредставлениеПараметра];	
				КонецЕсли;
			Иначе 	
				ЗначениеПараметра = мЭлементСравнения;
				Если Правило.УровеньВложенности = 9 Тогда 
					ЗначениеПараметра = Неопределено;
				ИначеЕсли Правило.УровеньВложенности = 1 Тогда 
					ЗначениеПараметра = ОбщегоНазначенияУХ.ПолучитьЗначениеРеквизита(ЗначениеПараметра, Правило.РеквизитАналитики);
				Иначе    
					Если СтрЧислоВхождений(Правило.ТаблицаАналитики,";") > 0 Тогда
						Правило.РеквизитАналитики = Правило.РеквизитАналитики + ".Ссылка";
						СписокПолей.Добавить("Представление_" + Правило.РеквизитАналитики, ПредставлениеПараметра, Ложь);
						Продолжить;	//пропускается описание общего реквизита составного типа, ищется правило с совпадающим типом
					КонецЕсли;
					мПравилоРеквизитАналитики = СтрРазделить(Правило.Поле, ".");//временное решение, собрать все значения нужно заранее
					Если мЭлементСравнения[мПравилоРеквизитАналитики[0]] = Неопределено Тогда 
						Продолжить;
					ИначеЕсли Не Правило.ТаблицаАналитики = "Справочник." + мЭлементСравнения[мПравилоРеквизитАналитики[0]].Метаданные().Имя Тогда 
						Продолжить; //для этой БД, этот тип реквизита составного типа не совпадает
					КонецЕсли;	
					Если ЗначениеЗаполнено(Правило.НастройкаСоответствияРеквизит) Тогда 
						Для Каждого м Из мПравилоРеквизитАналитики Цикл 
							ЗначениеПараметра = ОбщегоНазначенияУХ.ПолучитьЗначениеРеквизита(ЗначениеПараметра, м);
						КонецЦикла;	
					КонецЕсли;	
				КонецЕсли;  
				//СписокПолей.Добавить(Правило.РеквизитАналитики, ПредставлениеПараметра, Истина);
				//СтруктураПараметровЗапроса.Вставить(ПредставлениеПараметра, ЗначениеПараметра); 
			КонецЕсли;
			СписокПолей.Добавить(Правило.РеквизитАналитики, ПредставлениеПараметра, Истина);
			СтруктураПараметровЗапроса.Вставить(ПредставлениеПараметра, ЗначениеПараметра); 
		Иначе	
			Если Правило.ТаблицаАналитики = ТаблицаАналитики Тогда 
				СписокПолей.Добавить(Правило.РеквизитАналитики, ПредставлениеПараметра, Ложь);
			Иначе 
				СписокПолей.Добавить("Представление_" + Правило.РеквизитАналитики, ПредставлениеПараметра, Ложь);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	//Если СписокПолей.НайтиПоЗначению("НСИ_НеАктивный") = Неопределено Тогда
	//	СписокПолей.Добавить("НСИ_НеАктивный", "НСИ_НеАктивный");
	//КонецЕсли;	
	
КонецПроцедуры

// Собирает текст по реквизитам объекта, с нумерацией в пределах найденного по условиям значения 
//	если в результате запроса АВТОНОМЕРЗАПИСИ > 1, то это дубль
//
// Параметры:
//  СписокПолей			 - 	 - 
//  ИмяИсточникаДанных	 - 	 - 
//  СинхронизацияПоGUID	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СобратьТекстЗапроса_Рек(СписокПолей, ИмяИсточникаДанных, СинхронизацияПоGUID = Ложь)
	
	МассивПолей = Новый Массив;
	Для Каждого м Из СписокПолей Цикл
		МассивПолей.Добавить("АВТОНОМЕРЗАПИСИ() КАК АВТОНОМЕРЗАПИСИ");
		Если м.Значение = "GUID" Тогда
			МассивПолей.Добавить("УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Т.Ссылка) КАК GUID");
		ИначеЕсли Сред(м.Значение, 0, 14) = "Представление_" Тогда
			СтрокаЗапроса = "ПРЕДСТАВЛЕНИЕ(Т." + м.Значение + ") КАК " + м.Представление;
			СтрокаЗапроса = СтрЗаменить(СтрокаЗапроса, "Представление_", "");
		Иначе 	
			СтрокаЗапроса = "Т." + м.Значение + " КАК " + м.Представление;
		КонецЕсли;
		МассивПолей.Добавить(СтрокаЗапроса);
	КонецЦикла;	
	МассивПолей = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивПолей);
	ТекстЗапроса = "ВЫБРАТЬ" + Символы.ПС; 
	ТекстЗапроса = ТекстЗапроса + СтрСоединить(МассивПолей, "," + Символы.ПС);
	ТекстЗапроса = ТекстЗапроса + Символы.ПС + "ПОМЕСТИТЬ ВТ" + Символы.ПС;
	ТекстЗапроса = ТекстЗапроса + Символы.ПС + "ИЗ " + ИмяИсточникаДанных + " КАК Т" + Символы.ПС;	
	ТекстЗапроса = ТекстЗапроса + " ГДЕ " + Символы.ПС;
	МассивПолей.Очистить();
	Если СинхронизацияПоGUID Тогда 
		МассивПолей.Добавить("Т.Ссылка В (&МассивGUID)");
	Иначе	
		Для Каждого м Из СписокПолей Цикл
			Если м.Пометка Тогда  
				МассивПолей.Добавить("Т." + м.Значение + " = &" + м.Представление);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + СтрСоединить(МассивПолей, " И " + Символы.ПС);

	ТекстЗапроса = ТекстЗапроса + Символы.ПС + ";" + Символы.ПС;
	ТекстЗапроса = ТекстЗапроса + "ВЫБРАТЬ * ИЗ ВТ КАК Т" + Символы.ПС;
			
	Возврат ТекстЗапроса;
	
КонецФункции

// Собирает текст по табличным частям, с нумерацией в пределах каждой таблицы
//
// Параметры:
//  СписокПолей			 - 	 - 
//  ТабПравилаРабочие	 - 	 - 
//  ИмяИсточникаДанных	 - 	 - 
//  СинхронизацияПоGUID	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СобратьТекстЗапроса_ТЧ(СписокПолей, ТабПравилаРабочие, ИмяИсточникаДанных, СинхронизацияПоGUID = Ложь)

	Если НЕ НастройкаВыводитьТабличныеЧасти ИЛИ Не ЗначениеЗаполнено(СоответствиеВнешнимИБ) ИЛИ ТабПравилаРабочие.Количество() = 0 Тогда 
		Возврат "";
	КонецЕсли;	

	МассивПолейВсе = Новый Массив;
	МассивОператоров = Новый Массив;
//	ТаблицаАналитики = ТабПравилаРабочие.Скопировать(Новый Структура("УровеньВложенности", 1));
	ТаблицаАналитики = ТабПравилаРабочие.Скопировать();
	Для Каждого м Из ТаблицаАналитики Цикл
		Если СтрЧислоВхождений(м.ТаблицаАналитики, "ТабличнаяЧасть.") = 1 Тогда 
			ТабличнаяЧасть = СтрЗаменить(м.ТаблицаАналитики, "ТабличнаяЧасть.", "");
		КонецЕсли;
	//	МассивПолейВсе.Добавить(Новый Структура("ТабличнаяЧасть, РеквизитАналитики, ОписаниеПримитивногоТипа", ТабличнаяЧасть, м.РеквизитАналитики, м.ОписаниеПримитивногоТипа));
		МассивПолейВсе.Добавить(Новый Структура("ТабличнаяЧасть, ОписаниеОбъектаВИБ, РеквизитАналитики, ОписаниеПримитивногоТипа", ТабличнаяЧасть, м.ОписаниеОбъектаВИБ, м.РеквизитАналитики, м.ОписаниеПримитивногоТипа));
	КонецЦикла;
	ТаблицаАналитики = ТабПравилаРабочие.Скопировать(Новый Структура("УровеньВложенности", 1));
	ТаблицаАналитики.Свернуть("ТаблицаАналитики");
	
	Для Каждого м Из ТаблицаАналитики Цикл
		ТабличнаяЧасть = СтрЗаменить(м.ТаблицаАналитики, "ТабличнаяЧасть.", "");
		МассивПолей = Новый Массив;
		МассивПолей.Добавить("АВТОНОМЕРЗАПИСИ() КАК АВТОНОМЕРЗАПИСИ");
		МассивПолей.Добавить("УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Т.Ссылка) КАК GUID");
		МассивПолей.Добавить("Т_" + ТабличнаяЧасть + ".НомерСтроки КАК НомерСтроки");
		МассивПолей.Добавить("""" + м.ТаблицаАналитики + """" + " КАК ТаблицаАналитики");
		Для Каждого п Из МассивПолейВсе Цикл
			Представление = СтрЗаменить(п.РеквизитАналитики, ".", "_");
			Если ТабличнаяЧасть = п.ТабличнаяЧасть Тогда
				Поле = "Т_"+ п.ТабличнаяЧасть + "." + п.РеквизитАналитики;
				Если п.ОписаниеПримитивногоТипа = "" Тогда
					Поле = "ПРЕДСТАВЛЕНИЕ(" + Поле + ")";
				ИначеЕсли п.ОписаниеПримитивногоТипа = "Строка(0,Переменная)" Тогда
					Поле = "ПОДСТРОКА(" + Поле + ", 0, 1000)";
				КонецЕсли;	
				СтрокаЗапроса = Поле + " КАК " + п.ТабличнаяЧасть + "_" + Представление;
			Иначе
				СтрокаЗапроса = "Неопределено КАК " + п.ТабличнаяЧасть + "_" + Представление;
			КонецЕсли;	
			МассивПолей.Добавить(СтрокаЗапроса);	
		КонецЦикла;	
		ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 100" + Символы.ПС; 
		ТекстЗапроса = ТекстЗапроса + СтрСоединить(МассивПолей, "," + Символы.ПС);
		
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + "ПОМЕСТИТЬ ВТ" + МассивОператоров.Количество() + Символы.ПС;
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + "ИЗ " + ИмяИсточникаДанных + " КАК Т";	
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + "ЛЕВОЕ СОЕДИНЕНИЕ " + ИмяИсточникаДанных + "." + ТабличнаяЧасть + " КАК Т_" + ТабличнаяЧасть;
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + "ПО " + "Т_" + ТабличнаяЧасть + ".Ссылка = Т.Ссылка";
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + " ГДЕ " + Символы.ПС; 

		МассивПолей.Очистить();
		Если СинхронизацияПоGUID Тогда 
			МассивПолей.Добавить("Т.Ссылка В (&МассивGUID)");
		Иначе	
			Для Каждого м Из СписокПолей Цикл
				Если м.Пометка Тогда  
					МассивПолей.Добавить("Т." + м.Значение + " = &" + м.Представление);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + СтрСоединить(МассивПолей, " И " + Символы.ПС);

		МассивОператоров.Добавить(ТекстЗапроса);

	КонецЦикла;
		
	ТекстЗапроса = СтрСоединить(МассивОператоров, Символы.ПС + "; " + Символы.ПС);

	ТекстЗапроса = ТекстЗапроса + Символы.ПС + ";" + Символы.ПС;
	МассивПолейВсе.Очистить();
	Для Каждого м Из МассивОператоров Цикл 
		МассивПолейВсе.Добавить("ВЫБРАТЬ * ИЗ ВТ" + МассивПолейВсе.Количество() + " КАК Т" + Символы.ПС);
	КонецЦикла;	
	ТекстЗапроса = ТекстЗапроса + СтрСоединить(МассивПолейВсе, Символы.ПС + "ОБЪЕДИНИТЬ " + Символы.ПС);
	ТекстЗапроса = ТекстЗапроса + "УПОРЯДОЧИТЬ ПО НомерСтроки" + Символы.ПС;
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПодготовитьДанныеЗапроса(ТекстЗапроса, ТаблицаАналитикиВИБ, GUIDвнешнейСсылки = "", СтруктураПараметров = Неопределено)
	
	ИспользуемыеПараметры = Новый ТаблицаЗначений;
	ИспользуемыеПараметры.Колонки.Добавить("ИмяПараметра");
	ИспользуемыеПараметры.Колонки.Добавить("ПолеБД");
	ИспользуемыеПараметры.Колонки.Добавить("ЗначениеПараметра");
	ИспользуемыеПараметры.Колонки.Добавить("ВидСравнения");
	ИспользуемыеПараметры.Колонки.Добавить("Вычислять", ОбщегоНазначенияУХ.ПолучитьОписаниеТиповБулево());

	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("ТекстЗапроса", ТекстЗапроса);
	СтруктураЗапроса.Вставить("ПроизвольныйЗапрос", Истина);
	СтруктураЗапроса.Вставить("ТаблицаАналитикиВИБ", ТаблицаАналитикиВИБ);

	Если GUIDвнешнейСсылки <> "" Тогда 
		
		МассивGUID = Новый Массив();
		МассивGUID.Добавить(GUIDвнешнейСсылки);
		СтруктураЗапроса.Вставить("МассивGUID", МассивGUID);

		НоваяСтрока = ИспользуемыеПараметры.Добавить();
		НоваяСтрока.ИмяПараметра		= "МассивGUID";
		НоваяСтрока.ПолеБД				= "Ссылка";
		НоваяСтрока.ЗначениеПараметра	= СтруктураЗапроса.МассивGUID;
		НоваяСтрока.ВидСравнения		= "InList";
		
	Иначе		
		
		Для Каждого Элемент Из СтруктураПараметров Цикл
			НоваяСтрока = ИспользуемыеПараметры.Добавить();
			НоваяСтрока.ИмяПараметра		= Элемент.Ключ;
			НоваяСтрока.ПолеБД				= Элемент.Ключ;
			НоваяСтрока.ЗначениеПараметра	= Элемент.Значение;
			НоваяСтрока.ВидСравнения		= "Equal";
		КонецЦикла;	

	КонецЕсли;

	ИспользуемыеПоля = Новый ТаблицаЗначений;
	ИспользуемыеПоля.Колонки.Добавить("ИмяПоля");
	ИспользуемыеПоля.Колонки.Добавить("ПутьКДанным");
	
	Для Каждого Правило Из ТаблицаПравилИспользованияПолей Цикл 
		ДобавитьПолеВТаблицуПолей(ИспользуемыеПоля, Правило.РеквизитАналитики, Правило.Поле);
	КонецЦикла;
	
	ДанныеЗапроса = Новый Структура;
	ДанныеЗапроса.Вставить("ТекстЗапроса",			СтруктураЗапроса.ТекстЗапроса);
	ДанныеЗапроса.Вставить("ИспользуемыеПараметры",	ИспользуемыеПараметры);
	ДанныеЗапроса.Вставить("ИспользуемыеПоля",		ИспользуемыеПоля);
	ДанныеЗапроса.Вставить("ПроизвольныйЗапрос",	СтруктураЗапроса.ПроизвольныйЗапрос);
	ДанныеЗапроса.Вставить("ТаблицаАналитикиВИБ",	СтруктураЗапроса.ТаблицаАналитикиВИБ);
	
	Возврат ДанныеЗапроса;
	
КонецФункции
		
// Дополняет отсутствующими колонками в таблице Приемник
//
// Параметры:
//  Источник - ТаблицаЗначений - 
//  Приемник - ТаблицаЗначений - 
//
Процедура РасширитьКолонкиТаблицы(Источник, Приемник)
	Для Каждого Колонка Из Источник.Колонки Цикл 
		мКолонок = Приемник.Колонки.Найти(Колонка.Имя);
		Если мКолонок = Неопределено Тогда 
			Приемник.Колонки.Добавить(Колонка.Имя);	
		КонецЕсли;				
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначениеСоответствиеВнешнимИБ(ТекущийПараметрОбменаНСИ, ТипБД)
	
	ТекСоответствиеВнешнимИБ = Неопределено;
	Если ТипБД = Справочники.ТипыБазДанных.ПустаяСсылка() Тогда 
		ТипБД = Справочники.ТипыБазДанных.НайтиПоНаименованию("Бухгалтерия");//TODO задать другое соответствие		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПараметрыОбменаНСИ.Ссылка КАК Ссылка,
	|	ПараметрыОбменаНСИ.ОписаниеОбъектаМетаданных.ИмяОбъектаМетаданных КАК ИмяОбъектаМетаданных,
	|	ПараметрыОбменаНСИ.НаправлениеОбмена КАК НаправлениеОбмена,
	|	СправочникиБД.Ссылка КАК СправочникБДТекущаяИБ,
	|	СоответствиеВнешнимИБ.Владелец КАК Владелец,
	|	СоответствиеВнешнимИБ.Ссылка КАК СоответствиеВнешнимИБ,
	|	СоответствиеВнешнимИБ.ОписаниеОбъектаВИБ КАК ОписаниеОбъектаВИБ
	|ИЗ
	|	Справочник.ПараметрыОбменаНСИ КАК ПараметрыОбменаНСИ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СправочникиБД КАК СправочникиБД
	|		ПО (СправочникиБД.Ссылка = ПараметрыОбменаНСИ.ОписаниеобъектаМетаданных)
	|			И (СправочникиБД.Владелец = ЗНАЧЕНИЕ(Справочник.ТипыБазДанных.ТекущаяИБ))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СоответствиеВнешнимИБ КАК СоответствиеВнешнимИБ
	|		ПО (СоответствиеВнешнимИБ.ОписаниеОбъектаТек = СправочникиБД.Ссылка)
	|			И (СоответствиеВнешнимИБ.Владелец В(&МассивТипыБазДанных))
	|ГДЕ
	|	ПараметрыОбменаНСИ.Ссылка = &ТекущийПараметрОбменаНСИ";
		
	Запрос.УстановитьПараметр("МассивТипыБазДанных", ТипБД);
	Запрос.УстановитьПараметр("ТекущийПараметрОбменаНСИ", ТекущийПараметрОбменаНСИ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекСоответствиеВнешнимИБ = ВыборкаДетальныеЗаписи.СоответствиеВнешнимИБ;
	КонецЦикла;

	Возврат ТекСоответствиеВнешнимИБ;
		
КонецФункции

&НаСервере
Функция ПолучитьОбъектОбъектТекущейИБпоСсылкеВнешнейИБ(ОбъектВнешнейИБ)
	
	Результат = Новый Структура("ОбъектТекущейИБ, ИспользуемаяИБ");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СоответствиеОбъектовТекущейИВнешнихИБ.ОбъектТекущейИБ КАК ОбъектТекущейИБ,
		|	СоответствиеОбъектовТекущейИВнешнихИБ.ОбъектВнешнейИБ КАК ОбъектВнешнейИБ,
		|	СоответствиеОбъектовТекущейИВнешнихИБ.ИспользуемаяИБ КАК ИспользуемаяИБ
		|ИЗ
		|	РегистрСведений.СоответствиеОбъектовТекущейИВнешнихИБ КАК СоответствиеОбъектовТекущейИВнешнихИБ
		|ГДЕ
		|	СоответствиеОбъектовТекущейИВнешнихИБ.ОбъектВнешнейИБ = &ОбъектВнешнейИБ
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ПубличныеИдентификаторыСинхронизируемыхОбъектов.Ссылка,
		|	ПубличныеИдентификаторыСинхронизируемыхОбъектов.Идентификатор,
		|	ВИБ.Ссылка
		|ИЗ
		|	РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПубличныеИдентификаторыСинхронизируемыхОбъектов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВнешниеИнформационныеБазы КАК ВИБ
		|		ПО (ВИБ.УзелИнформационнойБазы = ПубличныеИдентификаторыСинхронизируемыхОбъектов.УзелИнформационнойБазы)
		|ГДЕ
		|	ПубличныеИдентификаторыСинхронизируемыхОбъектов.Ссылка = &ОбъектВнешнейИБ";
	
	Запрос.УстановитьПараметр("ОбъектВнешнейИБ", ОбъектВнешнейИБ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		ЗаполнитьЗначенияСвойств(Результат, ВыборкаДетальныеЗаписи);	
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьТаблицуСоответствиеОбъектовТекущейИВнешнихИБ(ТаблицаРезультат_0)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Т.GUID_Строкой КАК GUID_Строкой,
		|	Т.ВнешняяИБ КАК ВнешняяИБ
		|ПОМЕСТИТЬ ВТ0
		|ИЗ
		|	&ТаблицаРезультат_0 КАК Т
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Т.ВнешняяИБ КАК ВнешняяИБ,
		|	ВЫБОР
		|		КОГДА СоответствиеОбъектовТекущейИВнешнихИБ.ОбъектТекущейИБ ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьЗаписьСоответствия
		|ИЗ
		|	ВТ0 КАК Т
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеОбъектовТекущейИВнешнихИБ КАК СоответствиеОбъектовТекущейИВнешнихИБ
		|		ПО (СоответствиеОбъектовТекущейИВнешнихИБ.ОбъектВнешнейИБ = Т.GUID_Строкой)
		|		И (СоответствиеОбъектовТекущейИВнешнихИБ.ИспользуемаяИБ = Т.ВнешняяИБ)
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВнешниеИнформационныеБазы.НТ_Организации КАК ВнешниеИнформационныеБазыНТ_Организации
		|		ПО ВнешниеИнформационныеБазыНТ_Организации.Ссылка = Т.ВнешняяИБ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВнешниеИнформационныеБазыНТ_Организации.Организация,
		|	Т.ВнешняяИБ,
		|	ВЫБОР
		|		КОГДА СоответствиеОбъектовТекущейИВнешнихИБ.ОбъектТекущейИБ ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организация Убыв";
	
	ТаблицаРезультат_0.Колонки.Добавить("GUID_Строкой",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСтроки(40));
	мGUID = ТаблицаРезультат_0.ВыгрузитьКолонку("GUID");
	ТаблицаРезультат_0.ЗагрузитьКолонку(мGUID, "GUID_Строкой");
	Запрос.УстановитьПараметр("ТаблицаРезультат_0", ТаблицаРезультат_0);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции	

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокВнешнихИнформационныхБаз.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СписокВнешнихИнформационныхБаз.ФлагОшибкаСоединения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоРозовый);
 
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаПравилИспользованияПолейОтражение.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаПравилИспользованияПолейОтражение.КлючевоеПоле");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,,,Истина,,,));

	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаПравилИспользованияПолейОтражение.Имя);
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаПравилИспользованияПолейОтражение.УровеньВложенности");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 10;
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Льняной);

КонецПроцедуры

Функция ЗаполнитьПравилаИспользованияПолейПоУмолчанию(ТТ, ТекущийПараметрОбменаНСИ)
	
	мСписокВнешнихИнформационныхБаз = СписокВнешнихИнформационныхБаз.Выгрузить().Скопировать(Новый Структура("Выбран", Истина));
    мСписокВнешнихИнформационныхБаз.Свернуть("ТипБД");
	Для Каждого ЭлеменСписка Из мСписокВнешнихИнформационныхБаз Цикл 
		
		Макет = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("Правила_" + ТекущийПараметрОбменаНСИ + "_" + ЭлеменСписка.ТипБД);
		ПостроительЗапроса = Новый ПостроительЗапроса;
		ПостроительЗапроса.ИсточникДанных = Новый ОписаниеИсточникаДанных(Макет.Область());
		ПостроительЗапроса.Выполнить();
		ТаблицаРезультат_0 = ПостроительЗапроса.Результат.Выгрузить();
		
		Для Каждого м Из ТаблицаРезультат_0.Скопировать(Новый Структура("Выбран", "Истина")) Цикл 
			т = ТТ.Добавить();
			ЗаполнитьЗначенияСвойств(т, м);
			т.ТипБД = Справочники.ТипыБазДанных.НайтиПоНаименованию(ЭлеменСписка.ТипБД);
			т.Выбран = ?(м.Выбран= "Истина", Истина, Ложь);
			т.КлючевоеПоле = ?(м.КлючевоеПоле= "Истина", Истина, Ложь);
		КонецЦикла;	 
	КонецЦикла;	 
	
	Возврат ТТ;
КонецФункции	

#КонецОбласти

#Область ИнтеграцияСВнешнимиСистемамиУХ_КопияФункций

Функция ПолучитьДанныеНастройкиДляВыгрузки(НастройкаСоответствия)
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	СоответствиеВнешнимИБ.Ссылка КАК Ссылка,
	|	СоответствиеВнешнимИБ.ИмяОбъектаМетаданных КАК ИмяОбъектаМетаданных,
	|	СоответствиеВнешнимИБ.ТипОбъектаКонсолидации КАК ТипОбъектаКонсолидации,
	|	СоответствиеВнешнимИБ.ОписаниеОбъектаВИБ.Наименование КАК ИмяОбъектаВИБ,
	|	СоответствиеВнешнимИБ.ТаблицаАналитикиТек КАК ТаблицаАналитикиТек,
	|	СоответствиеВнешнимИБ.ТаблицаАналитикиВИБ КАК ТаблицаАналитикиВИБ,
	|	СоответствиеВнешнимИБ.ПроцедураПередЗаписьюВИБ КАК ПроцедураПередЗаписьюВИБ,
	|	СоответствиеВнешнимИБ.СинхронизацияПоGUID КАК СинхронизацияПоGUID,
	|	СоответствиеВнешнимИБ.ТипОбъектаВИБ КАК ТипОбъектаВИБ
	|ИЗ
	|	Справочник.СоответствиеВнешнимИБ КАК СоответствиеВнешнимИБ
	|ГДЕ
	|	СоответствиеВнешнимИБ.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", НастройкаСоответствия);
	
	Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Запрос.Выполнить().Выгрузить()[0]);
	
КонецФункции

Функция ПолучитьОписаниеТаблицыПравилаИспользованияПолей()
	
	ПравилаИспользованияПолей = Новый ТаблицаЗначений;
	ПравилаИспользованияПолей.Колонки.Добавить("Поле",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСтроки(500));
	ПравилаИспользованияПолей.Колонки.Добавить("Синоним",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСтроки(500));
	ПравилаИспользованияПолей.Колонки.Добавить("РеквизитАналитики",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСтроки(500));
	ПравилаИспользованияПолей.Колонки.Добавить("ТаблицаАналитики",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСтроки(500));
	ПравилаИспользованияПолей.Колонки.Добавить("ТаблицаАналитикиВИБ",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСтроки(500));
	ПравилаИспользованияПолей.Колонки.Добавить("АналитикаОперанда",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСсылка("ПланВидовХарактеристикСсылка.ВидыСубконтоКорпоративные"));	
	ПравилаИспользованияПолей.Колонки.Добавить("СоздаватьНовые",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповБулево());
	ПравилаИспользованияПолей.Колонки.Добавить("РазделятьПоОрганизациям",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповБулево());
	ПравилаИспользованияПолей.Колонки.Добавить("ОбновлятьРеквизитыПриИмпорте",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповБулево());
	ПравилаИспользованияПолей.Колонки.Добавить("НеИспользоватьДляСинхронизации",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповБулево());
	ПравилаИспользованияПолей.Колонки.Добавить("КодАналитики",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСтроки(500));
	ПравилаИспользованияПолей.Колонки.Добавить("НастройкаСоответствия",ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСсылка("СправочникСсылка.СоответствиеВнешнимИБ"));
	ПравилаИспользованияПолей.Колонки.Добавить("СпособЗаполнения", ОбщегоНазначенияУХ.ПолучитьОписаниеТиповСсылка("ПеречислениеСсылка.СпособыЗаполненияПолейИсточника"));
	ПравилаИспользованияПолей.Колонки.Добавить("ФиксированноеЗначение", Новый ОписаниеТипов(ОбщегоНазначенияУХ.ПолучитьМассивТиповЛюбаяСсылка()));
	
	Возврат ПравилаИспользованияПолей;
	
КонецФункции

#КонецОбласти

#Область ОбработкаURL

&НаКлиенте
Процедура НайтиОбъектПоURL(Команда)
	Если ПустаяСтрока(_URL) Тогда 
		Возврат;
	КонецЕсли;	
	ОбъектТекущейИБ = вНайтиОбъектПоURL(_URL);		
	Если ОбъектТекущейИБ = Неопределено ИЛИ СтрЧислоВхождений(Строка(ОбъектТекущейИБ), "не найден") = 1 Тогда
		Элементы.НайтиОбъектПоURL.ЦветФона = WebЦвета.СветлоРозовый;
	Иначе 	
		Элементы.НайтиОбъектПоURL.ЦветФона = WebЦвета.СветлоЗеленый;
	КонецЕсли;
	Если ОбъектТекущейИБ <> Неопределено И СтрЧислоВхождений(Строка(ОбъектТекущейИБ), "не найден") = 0 Тогда 
		//Объект найден по навигационной ссылке 
		ТипЗнчЭлемент = ТипЗнч(ОбъектТекущейИБ);
		Элементы.ОбъектТекущейИБ.ОграничениеТипа = вСоздатьОписаниеТипов(ТипЗнчЭлемент);
		ОбновитьИмяСправочникаПоВыбранномуОбъектТекущейИБ();
		ОбновитьТаблицаПравилИспользованияПолей(); /////////////
		ОбновитьКлючевыеПолеПоиска();
		ОбъектТекущейИБПриИзмененииНаСервере();
		ЭтоВнешняяСсылка = Ложь;
	ИначеЕсли ЭтоВнешняяСсылка Тогда  
		//Объект не найден по внешней ссылке, но можно определенить тип объекта
		Если СтрЧислоВхождений(_URL, "Контрагенты") = 1 Тогда  
			ОбъектТекущейИБ = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
			ТипЗнчЭлемент = ТипЗнч(ОбъектТекущейИБ);
			Элементы.ОбъектТекущейИБ.ОграничениеТипа = вСоздатьОписаниеТипов(ТипЗнчЭлемент);
		ИначеЕсли СтрЧислоВхождений(_URL, "КонтактныеЛица") = 1 Тогда  
			ОбъектТекущейИБ = ПредопределенноеЗначение("Справочник.КонтактныеЛица.ПустаяСсылка");
			ТипЗнчЭлемент = ТипЗнч(ОбъектТекущейИБ);
			Элементы.ОбъектТекущейИБ.ОграничениеТипа = вСоздатьОписаниеТипов(ТипЗнчЭлемент);
        КонецЕсли;
		ОбновитьИмяСправочникаПоВыбранномуОбъектТекущейИБ();
	КонецЕсли;
	
	ВыбраннаяВнешняяИБ = Неопределено;
	СтрокаПоискаВнешнейБД  = СтрРазделить(_URL, "#", Ложь);
	Если СтрокаПоискаВнешнейБД.Количество() > 1 Тогда 
		СтрокаПоискаВнешнейБД  = СтрРазделить(СтрокаПоискаВнешнейБД[0], "/");
		СтрокаПоискаВнешнейБД = СтрокаПоискаВнешнейБД[4];			
		ВыбратьВнешняяИБВСпискеПоСтроке(СтрокаПоискаВнешнейБД, ВыбраннаяВнешняяИБ);
		Если ВыбраннаяВнешняяИБ = Неопределено Тогда //вторая попытка поиска
			//путь публикации web сервиса и путь внешней ссылки не всегда совпадают, поэтому некоторые пути прописаны в коде
			Если СтрЧислоВхождений(СтрокаПоискаВнешнейБД, "1C_MSK_GCNVT_DOC") = 1 ИЛИ СтрЧислоВхождений(СтрокаПоискаВнешнейБД, "1C_DOC_i_stepanov") = 1 Тогда
				СтрокаПоискаВнешнейБД = "s1c-01-msk.hcnvt.ru/edo";
			КонецЕсли;			
			ВыбратьВнешняяИБВСпискеПоСтроке(СтрокаПоискаВнешнейБД, ВыбраннаяВнешняяИБ);
		КонецЕсли;	
	КонецЕсли;
	
	ОбновитьЗаголовокКнопкиСформироватьОтчет();
    НастройкаРежимПоискаПоРевизитам = Ложь;
	ОбновитьТаблицаПравилИспользованияПолей();
	НастройкаРежимПоискаПоРевизитамПриИзменении(Элементы._URL);

	Если кешИмяОбъектаМетаданных = "Контрагенты" И ЭтоВнешняяСсылка И ВыбраннаяВнешняяИБ <> Неопределено Тогда 		
		СформироватьОтчет(Команды.СформироватьОтчет); // запускает сценарий получения данных по ссылке, заполнения ключевых полей, поиска по ключемым полям по всем базам 
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыбратьВнешняяИБВСпискеПоСтроке(СтрокаПоискаВнешнейБД, ВыбраннаяВнешняяИБ)
	мИдентификаторСтроки = 0;
	Для Каждого м Из СписокВнешнихИнформационныхБаз Цикл 
		м.Выбран = Ложь;
		Если м.ТекущаяИБ И (ОбъектТекущейИБ <> Неопределено И Не ОбъектТекущейИБ.пустая()) Тогда 
			м.Выбран = Истина;	
		КонецЕсли;	
		Если СтрЧислоВхождений(м.ПутьКWebСервису, СтрокаПоискаВнешнейБД) = 1 Тогда 
			м.Выбран = Истина;	
			мИдентификаторСтроки = м.ПолучитьИдентификатор();
			ВыбраннаяВнешняяИБ = м.ВнешняяИБ;
		КонецЕсли;	
	КонецЦикла;
	Элементы.СписокВнешнихИнформационныхБаз.ТекущаяСтрока = мИдентификаторСтроки;
КонецПроцедуры

&НаСервере
Процедура ОбновитьИмяСправочникаПоВыбранномуОбъектТекущейИБ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПараметрыОбменаНСИ.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ПараметрыОбменаНСИ КАК ПараметрыОбменаНСИ
		|ГДЕ
		|	ПараметрыОбменаНСИ.ОписаниеОбъектаМетаданных.ИмяОбъектаМетаданных = &ИмяОбъектаМетаданных";
	
	Запрос.УстановитьПараметр("ИмяОбъектаМетаданных", ОбъектТекущейИБ.Метаданные().Имя);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекущийПараметрОбменаНСИ = ВыборкаДетальныеЗаписи.Ссылка; 
		кешИмяОбъектаМетаданных = ТекущийПараметрОбменаНСИ.ОписаниеОбъектаМетаданных.ИмяОбъектаМетаданных;
	КонецЦикла;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция вСоздатьОписаниеТипов(Знач пТип)
	пМассив = новый Массив;
	пМассив.Добавить(пТип);	
	Возврат новый ОписаниеТипов(пМассив);
КонецФункции

Функция вНайтиОбъектПоURL(Знач URL)
	
	Поз1 = Найти(URL, "e1cib/data/");
    Поз2 = Найти(URL, "?ref=");
	
	Если Поз1 = 0 или Поз2 = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ЭтоВнешняяСсылка Тогда                     
		GUIDвнешнейСсылки = ПолучитьGUIDПоНавигационнойСсылке(Сред(URL, Поз2 + 5));
		Результат = ПолучитьОбъектОбъектТекущейИБпоСсылкеВнешнейИБ(GUIDвнешнейСсылки);
		Возврат Результат.ОбъектТекущейИБ;
	КонецЕсли;	
	
	Попытка
	    ИмяТипа = Сред(URL, Поз1 + 11, Поз2 - Поз1 - 11);
	    ШаблонЗначения = ЗначениеВСтрокуВнутр(ПредопределенноеЗначение(ИмяТипа + ".ПустаяСсылка"));
	    ЗначениеСсылки = СтрЗаменить(ШаблонЗначения, "00000000000000000000000000000000", Сред(URL, Поз2 + 5));
	    Ссылка = ЗначениеИзСтрокиВнутр(ЗначениеСсылки);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Ссылка;
	
КонецФункции 

Функция ПолучитьGUIDПоНавигационнойСсылке(НавигационнаяСсылка)
	Стр = Прав(НавигационнаяСсылка, 32);
	ЧастиУИД = Новый Массив;
	ЧастиУИД.Добавить(Прав(Стр, 8));
	ЧастиУИД.Добавить(Сред(Стр, 21, 4));
	ЧастиУИД.Добавить(Сред(Стр, 17, 4));
	ЧастиУИД.Добавить(Лев(Стр, 4));
	ЧастиУИД.Добавить(Сред(Стр, 5, 12));
	СтрокаУИД = СтрСоединить(ЧастиУИД, "-");
	Возврат СтрокаУИД;
КонецФункции   

Функция ПолучитьНавигационнуюСсылкуПоGUID(GUID)
	НавигационнаяСсылка = Сред(GUID, 20, 4) + Прав(GUID, 12) + Сред(GUID, 15, 4) + Сред(GUID, 10, 4) + Лев(GUID, 8);
	Возврат НавигационнаяСсылка;
КонецФункции

Процедура ДобавитьПолеВТаблицуПолей(ТаблицаПолей, ПутьКДанным, ИмяПоля)
	
	НоваяСтрока             = ТаблицаПолей.Добавить();
	НоваяСтрока.ИмяПоля     = ИмяПоля;
	НоваяСтрока.ПутьКДанным = ПутьКДанным;
	
КонецПроцедуры

&НаКлиенте
Процедура _URLПриИзменении(Элемент)
	
	Поз1 = Найти(_URL, "e1cib/data/");
 	ЭтоВнешняяСсылка = Ложь;
	Попытка
	    ИмяБазы = Сред(_URL, 0, Поз1);
		Если Поз1 > 1 Тогда 
			ЭтоВнешняяСсылка = СтрЧислоВхождений(ИмяБазы, ЗаголовокСистемы()) = 0;
		КонецЕсли;
	Исключение
	КонецПопытки;
	Элементы.НайтиОбъектПоURL.Заголовок = "Найти объект по URL" + ?(ЭтоВнешняяСсылка, " (внешняя)", "");
	Элементы.НайтиОбъектПоURL.ЦветФона = WebЦвета.Белый;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаголовокСистемы()
	Возврат Константы.ЗаголовокСистемы.Получить();
КонецФункции

&НаКлиенте
Процедура СоздатьОбъектВЭтойБД(ВнешняяИБ)

	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ВыбраннаяВнешняяИБ", ВнешняяИБ);
	Если Строка(ТекущийПараметрОбменаНСИ) = "Контрагенты" Тогда 		
		РезультатПроверки = СоздатьОбъектВЭтойБД_Контрагенты_ПроверкаПередСозданием();
		Если РезультатПроверки.Отказ Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатПроверки.Сообщение, РезультатПроверки.НайденнаяСсылка);	
		Иначе 	
			ОписаниеОповещения = Новый ОписаниеОповещения("СоздатьОбъектКонтрагентЗавершение", ЭтотОбъект, ДополнительныеПараметры);
			ТекстВопроса = НСтр("ru = 'Создать Контрагента по данным этой БД?'");
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОбъектКонтрагентЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		СоздатьОбъектКонтрагентВЭтойБДНаСервере(ДополнительныеПараметры); 
		ЭтоВнешняяСсылка = Ложь;
		ОбъектТекущейИБПриИзмененииНаСервере();
		ОбновитьЗаголовокКнопкиСформироватьОтчет();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СоздатьОбъектВЭтойБД_Контрагенты_ПроверкаПередСозданием()

	РезультатПроверки = Новый Структура("Отказ, Сообщение, НайденнаяСсылка", Ложь);
	ДанныеВызова_Рек = ПолучитьИзВременногоХранилища(АдресДанныхОбъекта_Рек);
	Если ДанныеВызова_Рек = Неопределено ИЛИ ДанныеВызова_Рек[0].ПустойРезультат Тогда 
		РезультатПроверки.Отказ = Истина;
		РезультатПроверки.Сообщение = "В выбранной базе нет данных";
	Иначе 	
		НайденнаяСсылка = Справочники.Контрагенты.НайтиПоРеквизиту("НТ_КОД", ДанныеВызова_Рек[0].НТ_КОД);
		Если Не НайденнаяСсылка.Пустая() Тогда 
			РезультатПроверки.Отказ = Истина;
			РезультатПроверки.Сообщение = "Найден контрагент по коду: " + ДанныеВызова_Рек[0].НТ_КОД + " " + НайденнаяСсылка;
			РезультатПроверки.НайденнаяСсылка = НайденнаяСсылка;	
		КонецЕсли;
		Если ДанныеВызова_Рек[0].НТ_КОД <> ДанныеВызова_Рек[0].ГоловнойКонтрагент_НТ_КОД Тогда 
			НайденнаяСсылка = Справочники.Контрагенты.НайтиПоРеквизиту("НТ_КОД", ДанныеВызова_Рек[0].ГоловнойКонтрагент_НТ_КОД);
			Если НайденнаяСсылка.Пустая() Тогда 
				РезультатПроверки.Отказ = Истина;
				РезультатПроверки.Сообщение = "Не найден Головной контрагент по коду: " + ДанныеВызова_Рек[0].ГоловнойКонтрагент_НТ_КОД;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	Возврат РезультатПроверки;
	
КонецФункции

&НаСервере
Процедура СвязатьЭлементСЭтойБДНаСервере(ВыбраннаяВнешняяИБ)

	ТекущаяИБ = ПолучитьВнешняяИБПоИмени("Текущая информационная база");
	ВнешниеБД_СнятьОтметитьВсе(Команды.ВнешниеБД_ОтменитьВсе, Ложь, ТекущаяИБ);
	СформироватьОтчет_ПоРеквизитам(Истина); // помещает данные заполнения во временное хранилище
	ДанныеВызова_Рек = ПолучитьИзВременногоХранилища(АдресДанныхОбъекта_Рек);
	
	Если ДанныеВызова_Рек[0].GUID = Неопределено Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Объект еще не создан в этой базе");	
	Иначе 	
		Ссылка = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеВызова_Рек[0].GUID));
		ВнешниеБД_СнятьОтметитьВсе(Команды.ВнешниеБД_ОтменитьВсе, Ложь, ВыбраннаяВнешняяИБ);
		СформироватьОтчет_ПоРеквизитам(Истина); 

		ДанныеВызова_Рек = ПолучитьИзВременногоХранилища(АдресДанныхОбъекта_Рек); 
		Если ДанныеВызова_Рек[0].GUID = Неопределено Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не получилось получить данные из " + ВыбраннаяВнешняяИБ);	
		Иначе 	
			СоответствиеВнешнимИБ = ПолучитьЗначениеСоответствиеВнешнимИБ(ТекущийПараметрОбменаНСИ, ВыбраннаяВнешняяИБ.ТипБД);
			ИнтеграцияСВнешнимиСистемамиУХ.ЗаписатьСоответствиеОбъектовТекущейИВнешнейИБ(СоответствиеВнешнимИБ,
																ВыбраннаяВнешняяИБ,
																Ссылка,
																ДанныеВызова_Рек[0].GUID, //ДополнительныеПараметры.ОбъектВнешнейИБ
																ДанныеВызова_Рек[0].Наименование);	
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Связан объект с ID " + ДанныеВызова_Рек[0].GUID);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьОбъектКонтрагентВЭтойБДНаСервере(ДополнительныеПараметры)

	ТекСоединениеВИБ = УправлениеСоединениямиВИБУХ.ПолучитьСоединение(ДополнительныеПараметры.ВыбраннаяВнешняяИБ, 1);		
	Если ТекСоединениеВИБ = Неопределено Тогда
		Сообщить("Ошибка соединения с базой " + ДополнительныеПараметры.ВыбраннаяВнешняяИБ); 
		Возврат;
	КонецЕсли;

	ДанныеВызова_Рек = ПолучитьИзВременногоХранилища(АдресДанныхОбъекта_Рек);
 	СоответствиеВнешнимИБ = ПолучитьЗначениеСоответствиеВнешнимИБ(ТекущийПараметрОбменаНСИ, ДополнительныеПараметры.ВыбраннаяВнешняяИБ.ТипБД);

	ДД = Справочники.Контрагенты.СоздатьЭлемент();	
	ЗаполнитьЗначенияСвойств(ДД, ДанныеВызова_Рек[0]);
	Ссылка = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеВызова_Рек[0].GUID));
	ДД.УстановитьСсылкуНового(Ссылка);
	ДД.ГоловнойКонтрагент = Справочники.Контрагенты.НайтиПоРеквизиту("НТ_КОД", ДанныеВызова_Рек[0].ГоловнойКонтрагент_НТ_КОД);
	Если ДанныеВызова_Рек[0].НТ_КОД = ДанныеВызова_Рек[0].ГоловнойКонтрагент_НТ_КОД Тогда 
		ДД.ГоловнойКонтрагент = Ссылка;
	КонецЕсли;	
	ДД.СтранаРегистрации = Справочники.СтраныМира.НайтиПоКоду(ДанныеВызова_Рек[0].СтранаРегистрации_Код); 
	Если ДанныеВызова_Рек[0].ЮридическоеФизическоеЛицо = "Юридическое лицо" Тогда
		ДД.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
	ИначеЕсли ДанныеВызова_Рек[0].ЮридическоеФизическоеЛицо = "Юридическое лицо за пределами РФ" Тогда		
		ДД.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
	Иначе 	
		ДД.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
	КонецЕсли;
	ДД.РасширенноеПредставлениеИНН = ДД.ИНН;
	ДД.РасширенноеПредставлениеКПП = ДД.КПП;
	ДД.ИННВведенКорректно = Истина;
	ДД.КППВведенКорректно = Истина;
	ДД.ОбменДанными.Загрузка = Истина;
		
	ТаблицаСсылок = Новый ТаблицаЗначений();
	ТаблицаСсылок.Колонки.Добавить("Справочник_Контрагенты");
	ТаблицаСсылок.Колонки.Добавить("Справочник_КонтрагентыvzvЭлементСсылка");

	НН = ТаблицаСсылок.Добавить();
	НН.Справочник_Контрагенты = Неопределено;
	НН.Справочник_КонтрагентыvzvЭлементСсылка = ДанныеВызова_Рек[0].GUID;
	
	ТабСвязанныхОбъектов = ЗагрузитьДанныеСвязанныхОбъектов(ТекСоединениеВИБ, ТаблицаСсылок, СоответствиеВнешнимИБ, ДополнительныеПараметры.ВыбраннаяВнешняяИБ);
	
	Для Каждого т Из ТабСвязанныхОбъектов Цикл
		ДД[т.ИмяОбъектаТек].Загрузить(т.РабочаяТаблица);
	КонецЦикла;
	
	ТекстоваяСтрока = "#Загружено из " + ДополнительныеПараметры.ВыбраннаяВнешняяИБ + " " + ТекущаяДата();
	ЕстьСвойствоНТ_ИсточникДанных = Ложь;
	СвойствоНТ_ИсточникДанных = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("НТ_ИсточникДанных");
	НоваяСтрока = ДД.ДополнительныеРеквизиты.Добавить();
	НоваяСтрока.Свойство = СвойствоНТ_ИсточникДанных;
	НоваяСтрока.ТекстоваяСтрока = ТекстоваяСтрока;
	НоваяСтрока.Значение = ТекстоваяСтрока;
	
	ДД.Записать();
	ОбъектТекущейИБ = ДД.Ссылка;
	ИнтеграцияСВнешнимиСистемамиУХ.ЗаписатьСоответствиеОбъектовТекущейИВнешнейИБ(СоответствиеВнешнимИБ,
														ДополнительныеПараметры.ВыбраннаяВнешняяИБ,
														ДД.Ссылка,
														ДанныеВызова_Рек[0].GUID, //ДополнительныеПараметры.ОбъектВнешнейИБ
														ДанныеВызова_Рек[0].Наименование);
	ЗаполнитьСвязанныеРегистры(ТаблицаСсылок, ТабСвязанныхОбъектов);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстоваяСтрока , ДД.Ссылка);	
	
КонецПроцедуры 

Функция ЗагрузитьДанныеСвязанныхОбъектов(ТекСоединениеВИБ, Результат, ДанныеНастройки, ИспользуемаяИБ)
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	СоответствиеВнешнимИБСоответствияСвязанныхОбъектов.ТипОбъектаВИБ КАК ТипОбъектаВИБ,
	             |	СоответствиеВнешнимИБСоответствияСвязанныхОбъектов.ТипОбъектаТек КАК ТипОбъектаТек,
	             |	СоответствиеВнешнимИБСоответствияСвязанныхОбъектов.НастройкаСоответствия КАК НастройкаСоответствия,
	             |	СоответствиеВнешнимИБСоответствияСвязанныхОбъектов.ИзмерениеРегистраВИБ КАК ИзмерениеРегистраВИБ,
	             |	СоответствиеВнешнимИБСоответствияСвязанныхОбъектов.ИзмерениеРегистраТек КАК ИзмерениеРегистраТек,
	             |	СоответствиеВнешнимИБСоответствияСвязанныхОбъектов.НастройкаСоответствия.ТаблицаАналитикиВИБ КАК ТаблицаАналитикиВИБ,
	             |	ВЫБОР
	             |		КОГДА СоответствиеВнешнимИБСоответствияСвязанныхОбъектов.ОписаниеОбъектаВИБ ССЫЛКА Справочник.ТабличныеЧастиБД
	             |			ТОГДА СоответствиеВнешнимИБСоответствияСвязанныхОбъектов.ОписаниеОбъектаВИБ.Имя
	             |		ИНАЧЕ СоответствиеВнешнимИБСоответствияСвязанныхОбъектов.ОписаниеОбъектаВИБ.Наименование
	             |	КОНЕЦ КАК ИмяОбъектаВИБ,
	             |	ВЫБОР
	             |		КОГДА СоответствиеВнешнимИБСоответствияСвязанныхОбъектов.ОписаниеОбъектаТек ССЫЛКА Справочник.ТабличныеЧастиБД
	             |			ТОГДА СоответствиеВнешнимИБСоответствияСвязанныхОбъектов.ОписаниеОбъектаТек.Имя
	             |		ИНАЧЕ СоответствиеВнешнимИБСоответствияСвязанныхОбъектов.ОписаниеОбъектаТек.Наименование
	             |	КОНЕЦ КАК ИмяОбъектаТек
	             |ИЗ
	             |	Справочник.СоответствиеВнешнимИБ.СоответствияСвязанныхОбъектов КАК СоответствиеВнешнимИБСоответствияСвязанныхОбъектов
	             |ГДЕ
	             |	СоответствиеВнешнимИБСоответствияСвязанныхОбъектов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",ДанныеНастройки.Ссылка); 
	
	ТабСвязанныхОбъектов=Запрос.Выполнить().Выгрузить();
	
	Если ТабСвязанныхОбъектов.Количество()=0 Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	ТабСвязанныхОбъектов.Колонки.Добавить("РабочаяТаблица");
	
	КодАналитики=СтрЗаменить(ДанныеНастройки.ТаблицаАналитикиВИБ,".","_");
	ПолеСсылка=КодАналитики+"vzvЭлементСсылка";
	
	ТаблицаСсылок=Новый ТаблицаЗначений;
	ТаблицаСсылок.Колонки.Добавить("GUIDВнешнейИБ");
	ТаблицаСсылок.Колонки.Добавить("СсылкаТекущейИБ"); 
	
	Для Каждого Строка ИЗ Результат Цикл 
		
		НоваяСтрока=ТаблицаСсылок.Добавить();
		НоваяСтрока.GUIDВнешнейИБ=Строка[ПолеСсылка];
		НоваяСтрока.СсылкаТекущейИБ=Строка[КодАналитики];
		
	КонецЦикла;
	
	МассивСсылокВИБ=ТаблицаСсылок.ВыгрузитьКолонку("GUIDВнешнейИБ");
	
	Для Каждого СтрокаНастройка ИЗ ТабСвязанныхОбъектов Цикл
		
		СтрокаНастройка.РабочаяТаблица=Импорт_ПолучитьРабочуюТаблицуСвязанныхОбъектов(ТекСоединениеВИБ,СтрокаНастройка,ДанныеНастройки.ТаблицаАналитикиВИБ,МассивСсылокВИБ,ИспользуемаяИБ);
		
	КонецЦикла;
	
	Возврат ТабСвязанныхОбъектов;
	
	
КонецФункции// ЗагрузитьДанныеСвязанныхОбъектов()

Функция Импорт_ПолучитьРабочуюТаблицуСвязанныхОбъектов(ТекСоединениеВИБ,СтрокаНастройка,ТаблицаАналитикиВИБ,МассивGUID,ИспользуемаяИБ)
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	СоответствиеВнешнимИБСоответствиеРеквизитов.РеквизитОбъектаКонсолидации КАК РеквизитОбъектаКонсолидации,
	|	СоответствиеВнешнимИБСоответствиеРеквизитов.РеквизитОбъектаВнешнейИБ КАК РеквизитОбъектаВнешнейИБ,
	|	СоответствиеВнешнимИБСоответствиеРеквизитов.СпособЗаполнения КАК СпособЗаполнения,
	|	СоответствиеВнешнимИБСоответствиеРеквизитов.ФиксированноеЗначение КАК ФиксированноеЗначение
	|ИЗ
	|	Справочник.СоответствиеВнешнимИБ.СоответствиеРеквизитов КАК СоответствиеВнешнимИБСоответствиеРеквизитов
	|ГДЕ
	|	СоответствиеВнешнимИБСоответствиеРеквизитов.Ссылка = &Ссылка
	|	И (НЕ СоответствиеВнешнимИБСоответствиеРеквизитов.РеквизитОбъектаВнешнейИБ = """"
	|			ИЛИ СоответствиеВнешнимИБСоответствиеРеквизитов.ФиксированноеЗначение = НЕОПРЕДЕЛЕНО)";
	
	ТаблицаПолей=Новый ТаблицаЗначений;
	ТаблицаПолей.Колонки.Добавить("ПолеБД");
	ТаблицаПолей.Колонки.Добавить("ПолеПриемник");
	
	ТаблицаЗаполнения=Новый ТаблицаЗначений;
	ТаблицаЗаполнения.Колонки.Добавить("ФиксированноеЗначение");
	ТаблицаЗаполнения.Колонки.Добавить("ПолеПриемник"); 
	
	МассивСинонимов=Новый Массив;
	
	Запрос.УстановитьПараметр("Ссылка", СтрокаНастройка.НастройкаСоответствия);
	
	Результат=Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Результат.РеквизитОбъектаВнешнейИБ) Тогда
			
			Если МассивСинонимов.Найти(Результат.РеквизитОбъектаКонсолидации)=Неопределено Тогда
				
				НоваяСтрока=ТаблицаПолей.Добавить();
				НоваяСтрока.ПолеБД=ИнтеграцияСВнешнимиСистемамиУХ.УбратьПолеСсылка(Результат.РеквизитОбъектаВнешнейИБ);
				НоваяСтрока.ПолеПриемник=Результат.РеквизитОбъектаКонсолидации;
				
				МассивСинонимов.Добавить(Результат.РеквизитОбъектаКонсолидации);
				
			КонецЕсли;
			
		ИначеЕсли ЗначениеЗаполнено(Результат.ФиксированноеЗначение) Тогда
			
			НоваяСтрока=ТаблицаЗаполнения.Добавить();
			НоваяСтрока.ФиксированноеЗначение=Результат.ФиксированноеЗначение;
			НоваяСтрока.ПолеПриемник=Результат.РеквизитОбъектаКонсолидации;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДанныеВладельца=Новый Структура;
	ДанныеВладельца.Вставить("ТаблицаАналитикиВИБ",ТаблицаАналитикиВИБ);
	ДанныеВладельца.Вставить("МассивGUID",МассивGUID);
	
	ДанныеДляВыборки=Новый Структура;
	ДанныеДляВыборки.Вставить("ТаблицаАналитикиВИБ",?(СтрокаНастройка.ТипОбъектаВИБ="ТабличнаяЧасть",ТаблицаАналитикиВИБ+"."+СтрокаНастройка.ИмяОбъектаВИБ,СтрокаНастройка.ТаблицаАналитикиВИБ));
	ДанныеДляВыборки.Вставить("ПолеСсылка",?(СтрокаНастройка.ТипОбъектаВИБ="ТабличнаяЧасть","Ссылка",СтрокаНастройка.ИзмерениеРегистраВИБ));
	ДанныеДляВыборки.Вставить("ТаблицаПолей",ТаблицаПолей);	
	
	ДанныеТаблицы=ПолучитьДанныеСвязаннойТаблицыВИБ(ТекСоединениеВИБ,ДанныеВладельца,ДанныеДляВыборки);
	
	РабочаяТаблица=ОбменДаннымиНСИУХ.ПолучитьРабочуюТаблицуПоДаннымПереноса(ИспользуемаяИБ,ДанныеТаблицы);
	
	Для Каждого СтрокаЗаполнения ИЗ ТаблицаЗаполнения Цикл
		
		НоваяКолонка=РабочаяТаблица.Колонки.Добавить(СтрокаЗаполнения.ПолеПриемник);
		РабочаяТаблица.ЗаполнитьЗначения(СтрокаЗаполнения.ФиксированноеЗначение,СтрокаЗаполнения.ПолеПриемник);
		
	КонецЦикла;
	
	РабочаяТаблица.Колонки.Ссылка.Имя="_GUIDВнешнейИБ";
	
	Если РабочаяТаблица.Количество()>100 Тогда
		
		РабочаяТаблица.Индексы.Добавить("_GUIDВнешнейИБ");
		
	КонецЕсли;
	
	Возврат РабочаяТаблица;
		
КонецФункции // ПолучитьРабочуюТаблицу()

Функция ПолучитьДанныеСвязаннойТаблицыВИБ(ТекСоединениеВИБ,ДанныеВладельца,ДанныеДляВыборки) 
	
	СтруктураПараметров=Новый Структура;
	СтруктураПараметров.Вставить("ДанныеВладельца",ДанныеВладельца);
	СтруктураПараметров.Вставить("ДанныеДляВыборки",ДанныеДляВыборки);
	
	Если ТипЗнч(ТекСоединениеВИБ) = Тип("WSProxy") Тогда 
			
		Возврат ТекСоединениеВИБ.GetRelatedTableData(Новый ХранилищеЗначения(СтруктураПараметров, Новый СжатиеДанных(9))).Получить(); 
		
	ИначеЕсли ТипЗнч(ТекСоединениеВИБ) = Тип("Строка") Тогда
		
		Возврат РаботаСОбъектамиМетаданныхВнешнийУХ.ПолучитьОтвет1СШина(ТекСоединениеВИБ,"GetRelatedTableData",СтруктураПараметров);
		
	Иначе
		
		Возврат РаботаСОбъектамиМетаданныхВнешнийУХ.GetRelatedTableData(ТекСоединениеВИБ,СтруктураПараметров);
		
	КонецЕсли;
	
	
КонецФункции // ПолучитьДанныеСвязаннойТаблицыВИБ()

Процедура ЗаполнитьСвязанныеРегистры(ТаблицаСсылок, ТабСвязанныхОбъектов)
	
	МассивРегистров=ТабСвязанныхОбъектов.НайтиСтроки(Новый Структура("ТипОбъектаТек","РегистрСведений"));
	
	Для Каждого СтрокаСсылка ИЗ ТаблицаСсылок Цикл 
		
		Для Каждого СтрокаРегистр ИЗ МассивРегистров Цикл 
			
			МассивСтрок=СтрокаРегистр.РабочаяТаблица.НайтиСтроки(Новый Структура("_GUIDВнешнейИБ",СтрокаСсылка.GUIDВнешнейИБ));
		
			Если МассивСтрок.Количество()>0 Тогда
				
		//		ЗаписатьДанныеРегистра(СтрокаСсылка.СсылкаТекущейИБ,СтрокаРегистр,МассивСтрок);
				
			КонецЕсли;
			
		КонецЦикла;
				
	КонецЦикла;
		
КонецПроцедуры // ЗаполнитьСвязанныеРегистры() 

Процедура ЗаписатьДанныеРегистра(Ссылка,СтрокаРегистр,МассивСтрок)
	
	РабочийОбъект=РегистрыСведений[СтрокаРегистр.ИмяОбъектаТек].СоздатьНаборЗаписей();
	РабочийОбъект.Отбор[СтрокаРегистр.ИзмерениеРегистраТек].Установить(Ссылка);
	
	Для Каждого СтрокаЗаписи ИЗ МассивСтрок Цикл
		
		НоваяСтрока=РабочийОбъект.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаЗаписи);
		НоваяСтрока[СтрокаРегистр.ИзмерениеРегистраТек]=Ссылка;
		
	КонецЦикла; 
	
	Попытка
		
		РабочийОбъект.Записать(Истина);
		
	Исключение
		
		ТекстОшибки=ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения=СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Нстр("ru = 'Не удалось обновить данные связанного регистра %1 объекта %2:
		|%3'"),СтрокаРегистр.ИмяОбъектаТек,Ссылка,ТекстОшибки); 
			
		ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения,,,СтатусСообщения.Важное);
		
	КонецПопытки;	
	
КонецПроцедуры // ЗаписатьДанныеРегистра()  

#КонецОбласти