
//Функция СведенияОВнешнейОбработке() Экспорт
//	
//	ПараметрыРегистрации         = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
//	ПараметрыРегистрации.Вид     = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительныйОтчет();
//	ПараметрыРегистрации.Версия  = "1.0";
//	Команда                      = ПараметрыРегистрации.Команды.Добавить();
//	Команда.Представление        = Метаданные().Представление();
//	Команда.Идентификатор        = Метаданные().ПолноеИмя();
//	Команда.Использование        = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
//	Команда.ПоказыватьОповещение = Ложь;

//	Возврат ПараметрыРегистрации;
//	
//КонецФункции  

//Функция ПолучитьТаблицуКоманд()

//    Команды = Новый ТаблицаЗначений;
//    Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
//    Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
//    Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
//    Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
//    Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));

//    Возврат Команды;

//КонецФункции

//Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование = "ОткрытиеФормы", ПоказыватьОповещение = Ложь, Модификатор = "ПечатьMXL")

//    НоваяКоманда = ТаблицаКоманд.Добавить();
//    НоваяКоманда.Представление = Представление;
//    НоваяКоманда.Идентификатор = Идентификатор;
//    НоваяКоманда.Использование = Использование;
//    НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
//    НоваяКоманда.Модификатор = Модификатор;

//КонецПроцедуры
