
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)	
	Если Не Элементы.Список.ТекущаяСтрока = Неопределено Тогда 
		СписокПриАктивизацииСтрокиНаСервере(Элементы.Список.ТекущиеДанные.Ссылка)
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СписокПриАктивизацииСтрокиНаСервере(ТекущаяСтрокаСсылка)
	КлючЗаписиРег = РегистрыСведений.ДвоичныеДанныеФайлов.СоздатьКлючЗаписи(Новый Структура("Файл", ТекущаяСтрокаСсылка));
	Если Не КлючЗаписиРег.Пустой() Тогда
		АдресКартинки= ПолучитьНавигационнуюСсылку(КлючЗаписиРег, "ДвоичныеДанныеФайла");
	КонецЕсли;
КонецПроцедуры
