
/////////////////////////////////////////////////////////////////
//	РЕГЛ.ЗАДАНИЯ


//Процедура ПроверитьВозможностьВыполненияОбменов(ПриложениеВИнтернете = Ложь) Экспорт
//	
//	Если Не ПравоДоступа("Просмотр", Метаданные.ОбщиеКоманды.Синхронизировать) Тогда
//		
//		Если ПриложениеВИнтернете Тогда
//			ВызватьИсключение НСтр("ru = 'Недостаточно прав для синхронизации данных с приложением в Интернете.'");
//		Иначе
//			ВызватьИсключение НСтр("ru = 'Недостаточно прав для синхронизации данных.'");
//		КонецЕсли;
//		
//	ИначеЕсли ОбновлениеИнформационнойБазы.НеобходимоОбновлениеИнформационнойБазы()
//	        И Не ОбменДаннымиСлужебный.РежимЗагрузкиСообщенияОбменаДаннымиПередЗапуском("ЗагрузкаРазрешена") Тогда
//		
//		Если ПриложениеВИнтернете Тогда	
//			ВызватьИсключение НСтр("ru = 'Приложение в Интернете находится в состоянии обновления.'");
//		Иначе
//			ВызватьИсключение НСтр("ru = 'Информационная база находится в состоянии обновления.'");
//		КонецЕсли;
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//Процедура ПроверитьИспользованиеОбменаДанными(УстановитьИспользование = Ложь) Экспорт
//	
//	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьСинхронизациюДанных") Тогда
//		
//		Если Не ОбщегоНазначения.РазделениеВключено()
//			И УстановитьИспользование
//			И ПравоДоступа("Редактирование", Метаданные.Константы.ИспользоватьСинхронизациюДанных) Тогда
//			
//			Попытка
//				Константы.ИспользоватьСинхронизациюДанных.Установить(Истина);
//			Исключение
//				ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
//				ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрацииОбменДанными(), УровеньЖурналаРегистрации.Ошибка,,,ТекстСообщения);
//				ВызватьИсключение ТекстСообщения;
//			КонецПопытки;
//			
//		Иначе
//			ТекстСообщения = НСтр("ru = 'Синхронизация данных запрещена администратором.'");
//			ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрацииОбменДанными(), УровеньЖурналаРегистрации.Ошибка,,,ТекстСообщения);
//			ВызватьИсключение ТекстСообщения;
//		КонецЕсли;
//		
//	КонецЕсли;
//	
//КонецПроцедуры


